   {"tag": "Anki-WhatIsAnki",
    "patterns": ["What is anki", "What is SRS", "What is spaced repetition system", "what does anki do", "What’s Anki", "What is anki study"],
    "responses": ["Anki is the recommended SRS to use with Refold. SRS stands for \" Spaced repetition system\". SRS are basically flashcards that use an algorithm that attempts to show you information just before you forget them, rather than entirely randomly. This makes studying material much more effective and efficient. Anki is recommended because of the many powerful tools for language learning that make it the best option out there. I recommend you check out the resources below from Refold to learn more about Anki and how it works."],
    "Field-1": ["Stage-0 Active Study", "This article goes over the SRS and why we use it for language learning", "https://refold.la/roadmap/stage-0/c/active-study"],
    "Field-2": ["Stage-1 Anki Setup", "This covers the basics of Anki and how to use it.", "https://refold.la/roadmap/stage-1/a/anki-setup"],
    "Field-3": ["", "", ""],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"Do I have to use Anki?",
    "context_set": ""
   },
   {"tag": "Anki-DoIHaveToUseAnki",
    "patterns": ["Do I have to use Anki", "Do I need to use Anki", "Do I need to use SRS", "is anki nessesary", "do i have to usue an srs", "is srs nessesary", "Is Anki necessary", "is srs necessary", "What if I don't want to use SRS Program", "Should I use Anki"],
    "responses": ["In the end, Anki is just a supplement to the actual method. The primary and most crucial part of Refold is immersion. Anki is just there to help prime words and get them on your radar to make them easier to fully acquire during immersion. Many people have become fluent without ever using Anki or SRS programs.\n\nWith that being said, we recommend using Anki. Learning a language is a long journey, and we genuinely do believe that with Anki, the process will go a little faster. If you find Anki a terrible part of the process, then try not going so hard with it. Even 5 words or less a day can help. Just pick a manageable number for yourself and go with it. Even 5 a day is better than nothing and should keep your review time low and manageable. "],
    "Field-1": ["The role of the SRS", "This video goes in detail about why we use the SRS and how to best use it", "https://www.youtube.com/watch?v=wrBFhsnBQ2k"],
    "Field-2": ["Stage-1 SRS best practices", "This article goes over some best ways to use the SRS", "https://refold.la/roadmap/stage-1/c/srs-best-practices"],
    "Field-3": ["", "", ""],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"",
    "context_set": ""
   },
   {"tag": "Anki-PassiveDuringAnki",
      "patterns": ["Should I do passive immersion during my flashcards", "should I do passive immersion while doing my flashcards", "should I be doing passive immersion during flashcards", "should I be doing passive immersion during anki", "should I do passive immersion with anki", "When I'm doing my anki deck should be doing passive immersion", "should I do passive immersion during anki", "should I do passive immersion during anki reps"],
      "responses": ["It is not recommended that you do passive immersion during your SRS/Anki time. Instead, you want to make sure you are only focused on your Anki repetitions to ensure your brain knows that what it is doing is important and should be remembered."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
   },
   {"tag": "Anki-RestartDeck",
      "patterns": ["How do I restart an anki deck", "How to start an anki deck fresh", "how do you reset an Anki deck", "How do i restart my Tango Deck", "How do I restart my JP1k deck", "How can I restart a deck in Anki", "How do I restart a deck in Anki", "how do I catch up on a lot of reviews", "backlog of reps", "how do I catch up in anki", "What if I miss a lot of days of anki", "What do I do with a large backlog of anki reps", "Backlog of anki reps", "Anki backlog", "how do I handle an Anki backlog"],
      "responses": ["It is not recommended that you restart a deck. Instead, follow the advice in the article linked below on catching up if you have many built-up reviews.\n\nThe reason for this is that even though you won't remember many of the cards, many you will remember. If you start over, you will have to start those known cards fresh, which is a big waste of time. It's better to slowly work through your backlog of due cards. This way, your known cards stay where they are, and forgotten cards begin to refresh.\n\nWith that said, if you wish to restart your deck, the best way is to delete the deck and load it in fresh. This ensures all cards are in the intended order (Make sure you still have access to the fresh Anki deck before deleting the old one). You can also select cards from the Anki browser and right-click them, selecting \"reschedule...\" and sending them to the back of the card queue. This likely will shuffle the cards into a different order than you desired, though, so it isn't preferred."],
      "Field-1": ["SRS - Falling Behind", "Refold article on how to catch up with a large amount of due cards.", "https://refold.la/roadmap/stage-1/c/srs-best-practices#Falling-Behind"],
      "Field-2": ["Reset Anki cards new", "This short video goes over how to reset cards if you absolutely must. This is not recommended", "https://www.youtube.com/watch?v=tG-WgW6U8ds"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-HowManyCardsADay",
      "patterns": ["How many cards should I do per day", "how much anki should I do per day", "how many vocab per day", "Is 5 cards per day enough for the JP1K", "Is 10 cards per day enough for the JP1K", "Is 15 cards per day enough for the JP1K", "Is 20 cards per day enough for the JP1K","Is 5 cards per day enough for the Tango", "Is 10 cards per day enough for the Tango", "Is 15 cards per day enough for the Tango", "Is 20 cards per day enough for the Tango", "Is 5 cards per day", "Is 15 cards per day", "Is 20 cards per day", " or should i do more", "How much Anki a day should I do", "How many cards should I do a day", "how many vocabulary should I do a day", "How many cards should I do for jp1k a day", "How many new cards in the jp1k deck should I do a day", "how much anki should i do", "How many cards in the jp1k deck should I do a day", "How many anki cards should i do a day", "recommended number of cards per day for JP1K", "how much time should i spend per day on anki"],
      "responses": ["Anki is a supplement to immersion. Many people get into the trap of thinking more Anki means quicker progress. In reality, it's the balance of Anki to immersion that leads to more rapid progress. The recommended amount of cards per day is 10-20, but less is also acceptable. Also, keep in mind that new words will be harder to learn early in the process because you have nothing to associate new words to. So your early cards per day may be much less. Find a balance that works for you.\n\n**Another way to look at cards per day**\nAnother way to look at cards per day is to not add a specific amount of cards per day at all. Some have found success in allotting a time for Anki rather than a card count. My personal recommendation is that you should be doing a MAX (less is fine) of 30 minutes of Anki for every 1.5 hours of immersion (for a total of 2 hours) with an Anki cap of 2 hours. So at 3 hours of immersion, you have 1 hour of Anki (4 hours total), and at 6 hours of immersion, you cap out at 2 hours of Anki and just add more immersion beyond this. I like this method because it ensures that you don't cut into immersion time to keep up on your Anki card goal.\n\nIf you chose the time method above, it's important to note that you always finish your reps for the day. If you run out of time, finish your backlog of cards, but don't add new cards. If you have time, add as many new cards as you can for that day in the remaining time. I do recommend capping your daily cards, though, at 20-30 max, even if you have time remaining, so you trickle cards out and don't have huge swings in cards per day."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-HowManyCardsToMine",
      "patterns": ["How many cards to mine", "how many cards should I mine"],
      "responses": ["It's probably good to mine more cards than you need for the day in case you discover later that some of the sentences arent actually 1T sentences, or just don't work for whatever reason. I've also provided you a related question."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How many cards should I do per day?",
      "context_set": ""
     },
     {"tag": "Anki-RecomendedSettings",
      "patterns": ["What Anki settings should I use", "what are the recommended Anki settings", "what should I make my Anki settings", "How do I set up Anki"],
      "responses": ["I found this resource for you linked below. This article should show you all the Refold recommended Anki settings. Good luck!"],
      "Field-1": ["Anki Settings", "Learn the recomended Refold Anki settings", "https://refold.la/roadmap/stage-1/a/anki-setup#Options"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-IsAnkiAllYouNeed",
      "patterns": ["Is regular Anki good enough for studying", "is anki all you need", "what is recomended flashcard program", "what is recomended SRS", "should I use the most up to date anki"],
      "responses": ["Anki is the recommended SRS (flashcard) program to use. Use whatever the most recent version is on their website unless you want to use addons that require a different version. You will have to find compatible versions in this case on your own. Most addons that need an older version will link to where you can find compatible versions. Otherwise, just download and install the most recent version."],
      "Field-1": ["Anki Flaschards", "Download Here", "https://apps.ankiweb.net/"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What Anki settings should I use?",
      "context_set": ""
     },
     {"tag": "Anki-DoIContinueAnkiAfterfoundationDeck",
      "patterns": ["After I finish JP1k should I continue Anki", "Should I keep using anki after Jp1k", "After I finish Tango should I continue Anki", "Should I keep using anki after Tango", "Should I keep using anki once i'm done with foundation deck", "Do I keep using anki after foundation deck"],
      "responses": ["After you finish your foundation vocabulary deck, we still recommend using Anki, but we no longer recommend premade decks. Instead, you will do what is called \"sentence mining\n to find and learn new vocabulary."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What is sentence mining?",
      "context_set": ""
     },
     {"tag": "Anki-HowShouldIGradeThisCards",
      "patterns": ["How should I grade cards", "how do I grade cards", "how should I grade sentence cards", "how do I grade sentence cards", "should I pass or fail", "Do I hit good or again", "how to rep vocab cards", "how do I rep sentence cards", "what should I focus on in my anki vocab reviews", "grading anki cards"],
      "responses": ["This is kind of a personal choice but this video should help you get some things to think about."],
      "Field-1": ["How to grade sentence cards", "MattVsJapan video on how to grade cards", "https://www.youtube.com/watch?v=zMBXwo9SJbQ"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-NotetypeTemplates",
      "patterns": ["What note type should I use", "are there note templates", "what are recomended card formats", "what are recomended note templates"],
      "responses": ["How you format your card is completely up to you and personal preference."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhatToDoWithLeechesLotsOfLeeches",
      "patterns": ["What should I do about leeches", "What do I do if i'm getting a lot of leeches", "should I delete leeches", "what are leeches", "What should I do about leaches", "what to do with leech card"],
      "responses": ["Leeches are what happen in Anki when you mark a card wrong a given amount of times. You set this number in deck options, and once this number of times failed is reached, Anki will either tag or delete the card; however you have it set up. Refold believes that constantly hunting for easy, low-hanging fruit that is within your range to learn is the best and fastest method to chipping away at the language. Because of this, we recommend setting your leeches at 5 and allowing leeched cards to suspend or delete.\nNote: Every time you get a card wrong, it goes into a **learning** mode. Marking a card incorrect when in learning mode does not add a counter to the leech number. So if you get a card wrong that day, and then that same day you mark it wrong 10 more times without ever getting it correct, this still only counts as 1 leech counter. Only after you mark it correct, then see it again on a different day, will marking it incorrect add a counter to the leech counter."],
      "Field-1": ["Snowball effect", "This video goes over low hanging fruit, the snowball effect and why it's so important to progress as it pertains to leeches and accepting ambiguity", "https://www.youtube.com/watch?v=lj-fS-BKrqg&feature=youtu.be"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhatAreRecomendedAnkiAddons",
      "patterns": ["What are recomended anki addons", "What are recomended addons", "what anki addons should I use", "what are some good anki addons"],
      "responses": ["A list of some of the most commonly used Anki addons can be found in the Refold Tech and Tools document. Go down to the Anki Addons section."],
      "Field-1": ["Refold Tech and Tools", "Document to share tools that are useful for language learning", "https://docs.google.com/document/d/1z_5VbwqKjuyaDH8l6BqhAPJdHWAfypz-3V7pHsWHr6A/edit#"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhatTypeOfVocabularyCardsWordOrSentence",
      "patterns": ["Vocab or sentence cards", "should I make vocabulary or sentence cards", "Should I make vocab or sentence cards", "What type of vocab cards should I make", "what is better vocab cards or sentence cards", "what's better vocabulary or sentence cards", "should I make reading cards or audio cards", "reading or audio cards", "what type of anki card to make"],
      "responses": ["This is really a personal preference. The two resources below can provide you some more info to make your choice."],
      "Field-1": ["Vocab Vs Sentence cards", "MattVsJapan gives his thoughts on vocab vs sentence cards", "https://www.youtube.com/watch?v=GLfmKWhLhjk"],
      "Field-2": ["Advanced sentence mining", "This article also goes over the different card types.", "https://refold.la/roadmap/stage-2/b/advanced-sentence-mining"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhereDoIGetAnki",
      "patterns": ["Where do I get anki", "where can I get anki", "where do I download anki"],
      "responses": ["If you don't need an older version to be compatible with a specific Anki addon, then the most recent version is at the link below. If you do need an older version, you will have to find it on your own. Some add-ons, like the Migaku add-ons, provide links to compatible versions, so check their addon page for more info."],
      "Field-1": ["Anki Flashcards", "Download the most recent version here", "https://apps.ankiweb.net/"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-HowDoIUseAnki",
      "patterns": ["How to use anki", "what are the basics of anki", "what are anki basics", "how do I use anki", "what are some good anki tutorials", "are there any good anki tutorials", "how do I setup anki", "how do you setup anki", "how do I install anki", "where do I find anki", "how do I get started with anki"],
      "responses": ["The article below will give you the basics of Anki and how to set it up and use it. Anki is not the most user-friendly, intuitive program. People who are not good with computers will have to accept that becoming comfortable with Anki will take some time. I recommend learning the bare minimum to get what you need at that moment and just accept that you will get more and more comfortable with it over time. There are also YouTube videos you can watch going over Anki's basics and advanced features. So if this article doesn't provide enough information, then I recommend looking up some other tutorials on your own."],
      "Field-1": ["Refold Anki Basics", "Basic Anki setup and operation", "https://refold.la/roadmap/stage-1/a/anki-setup"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhatIsAGoodAnkiRetentionRate",
      "patterns": ["What is a good anki retention rate", "what should my anki retention rate be", "anki retention rate"],
      "responses": ["Ideally, you want to have between a 80-90% retention rate. Anything higher or lower is generally considered to be suboptimal. However, if you are lower, don't worry. You might just need more immersion, add fewer cards per day, or adjust your settings a little bit."],
      "Field-1": ["Anki Algarithm", "MattVsJapan goes over Anki algorithm and adjusting the settings to help fine-tune your retention rate.", "https://www.youtube.com/watch?v=lz60qTP2Gx0"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-HowDoIUseYomichan",
      "patterns": ["how do you use yomichan", "how do I use yomichan", "yomichan tutorial", "How do I set up yomichan"],
      "responses": ["I've linked you below to a Yomichan tutorial, as well as some dictionaries you can use."],
      "Field-1": ["Yomichan Tutorial", "Here is all you need to know", "https://foosoft.net/projects/yomichan/"],
      "Field-2": ["Yomichan/Migaku dictionaries", "MattVsJapan provides 10+ yomichan and Migaku compatible dictionaries. Both Bilingual and monolingual", "https://www.youtube.com/watch?v=5oxdPY9eH48"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-IsItOkayToFailACardManyTimesInARow",
      "patterns": ["What do I do if I cannot remember a card after failing it several times in a row", "fail a card over and over"],
      "responses": ["It is completely fine to fail a card many times. However, always remember to let leeches leech, and never be afraid to suspend a card giving you particular problems. It's better to keep hunting for low-hanging fruit rather than artificially cramming things your brain isn't ready to remember. But that being said, a little bit of cramming is to be expected, especially early on when everything is so new."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What should I do about leeches?",
      "context_set": ""
     },
     {"tag": "Anki-WhatJapaneseFont",
      "patterns": ["What font should I use", "how do I know if i'm using the right font"],
      "responses": ["Any font that you like and displays Japanese characters should be fine. With that being said, **yuumichou** is the one my creator uses. Using yuumichou you can be sure that you are using a font that displays Japanese Kanji and not Chinese kanji, because they can often be different."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhenShouldIStopAnki",
      "patterns": ["When should i stop using anki", "do you ever stop using anki", "do I ever stop using anki", "Can I delete Anki"],
      "responses": ["This is a personal choice. In short, use it until you feel you no longer benefit from it. That being said; generally, Refold members continue to use Anki until stage 3 or 4. Once you can understand enough of your immersion to guess unknown words from context alone, you will need Anki less and less. However, some choose to continue using Anki, although almost always at a reduced rate."],
      "Field-1": ["The SRS Endgame", "MattVsJapan video going over not using Anki anymore.", "https://www.youtube.com/watch?v=u3sqHvdpBwM"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhenShouldIStartAnki",
      "patterns": ["When should I start using anki", "should I start using anki in stage 1", "Should I start using Anki for vocabulary even if im at stage 1", "Should I use Anki in stage"],
      "responses": ["Basically, from the start, you use Anki. We use Anki to gain a foundation in stage 1 with premade Anki decks and then further build on that foundation in stage 2 with sentence mining. I recommend that you check out all the resources in <#784120941650509865>. The guide posted there will walk you through step by step what to do in stage 1."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What is Anki?  //  How do I get started?  //  How do I learn vocabulary?",
      "context_set": ""
     },
     {"tag": "Anki-WhatIsLingQ",
      "patterns": ["what is LingQ", "is Linq any good", "should I use lingq"],
      "responses": ["LingQ is a website you can import text into, or chose from their pool of content and use their tools to lookup unknown words and mark words as known or unknown. While it is not a bad tool, we don't feel it is worth the money and that using Netflix, YouTube, etc, with the immersion tools available, such as Yomichan, is just as good if not better. With that being said, though, LingQ is not a bad tool and if you want to try it, go for it."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhatIsLearningLanguageWithNetflixYouTube",
      "patterns": ["what is Learning with netflix", " what is LLWNF", "What is learning language with youtube", "what is LLWYT", "How do I immerse with netflix", "what is language learning with netflix", "What is Language Reactor", "where can I get language reactor", "how to download language learning with netflix chrome extension", "how to download Language Reactor Chrome extension"],
      "responses": ["Language Reactor (formerly Language Learning with Netflix, or LLWNF) is a Chrome add-on that allows you to look up words from Netflix Subtitles as well as navigate subtitles with arrow keys. It's a really great tool, and I recommend checking it out. I recommend using this tool along with Yomichan rather than using the built-in dictionaries."],
      "Field-1": ["Language Reactor", "Chrome extension to help immersing on Netflix, YouTube and more", "https://www.languagereactor.com/"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How do I use Yomichan?",
      "context_set": ""
     },
     {"tag": "Anki-IndiferentResources",
      "patterns": ["Is Duolingo good", "Is lingodear good"],
      "responses": ["There are many resources out there, such as Duolingo, Lingodeer etc. While I cant touch on every single last one of them, for the most part these resources are not recomeneded. I recomend checking out the comunity document and finding resources from there that fit better with immersion based learning. That being saidi, almost no resource is **bad**. It's how you use it more than what you use. The problem with resources like Dulingo though are built around activities"],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-DoesAnkiCountAsImmersion",
      "patterns": ["Does Anki count as immersion", "is anki immersion"],
      "responses": ["No. Your time in Anki does not count as any type of immersion. It's a suppliment to immersion."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WillIBeFluentWithDuolingo",
      "patterns": ["Will I be fluent if I use duolingo", "can i get fluent with duolingo", "Can I learn japanese by doing 15 minutes of duolingo per day"],
      "responses": ["If you ONLY use Duolingo and don't pair your time with Duolingo with A LOT of immersion (vastly more time than you spend inside Duolingo), then no. Even 100% completion of Duolingo will not result in very high language ability. Therefore, we do not recommend using Duolingo."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-RememberNothingAfterAnki",
      "patterns": ["Is it normal to feel like I can't remember anything after Anki", "I feel like Anki does not teach me words"],
      "responses": ["It's normal to feel like words aren't very solidified from Anki. That's because they aren't. Anki's role is to prime words and concepts in your head. But you WILL have a problem remembering those words and concepts outside the SRS. Because the brain is very contextual, it will feel it only needs to remember it when you are using the SRS and have problems recalling outside of it. But, Anki will help get memories started in your brain. To drill in faint familiarity with that vocabulary and concepts so that when you later come across those elements in your immersion, you will be able to acquire them much faster."],
      "Field-1": ["The role of the SRS", "MattVsJapan video going over this idea.", "https://www.youtube.com/watch?v=wrBFhsnBQ2k"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-GoodTexthooker",
      "patterns": ["what's a good texthooker application", "what's a good texthooker", "what is a good texthooker", "How do I immerse in visual novels"],
      "responses": ["This article should help you figure out how to get started with Visual Novels and also covers Texthooker."],
      "Field-1": ["Visual Novels", "The Moe Way guide on text hookers", "https://learnjapanese.moe/vn/"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-HowLongPerCard",
      "patterns": ["When you study an anki card, how long should you spend on 1 card", "how long should I spend per card", "how long should I take per card", "how many seconds per card"],
      "responses": ["While there is a more nuanced, complicated answer to this, for beginners using sentence cards, between 15-30 seconds per card is an acceptable range. As you gain experience, you'll start to form a sense of what is optimal for you. Just be careful not to get caught in the trap of thinking Anki (SRS) is where the magic happens. You want your choices to minimize time and maximize the effectiveness of the SRS so you can spend as much time as possible immersing. The SRS is a supplement to immersion, not the other way around."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhereIsRRTKDeck",
      "patterns": ["Where can I find RRTK Anki Deck", "can someone please direct me to where I can find RRTK anki deck", "Where can I find the RRTK Anki Deck"],
      "responses": ["RRTK is not the recommended method for getting a Kanji foundation anymore. Instead, check out the Refold JP1K deck. That said, if you don't wish to use the JP1K deck, here is the RRTK deck as well."],
      "Field-1": ["Learn about JP1K", "This article explains JP1K and where to get it", "https://refold.la/japanese/deck"],
      "Field-2": ["Stage 1 JP Guide", "Step by step guide on Refold stage 1 specificly for Japanese.", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
      "Field-3": ["Official RRTK Deck", "Link to official deck with no stories.", "https://www.mediafire.com/file/1svvsr7f9cnpwka/Recognition_RTK.apkg/"],
      "Field-4": ["Online Stories RRTK deck", "Link to a version with online mnemonics. Some stories can be inappropriate.", "https://www.mediafire.com/file/p8d2iu6sygzdqvv/Recognition_RTK_%28With_Stories%29.apkg/file"],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-WhereIsTangoDeck",
      "patterns": ["Tango N5 download", "Where can I get the tango N5 deck", "where can I get the tango N4 deck"],
      "responses": ["The Tango decks are no longer the recommended vocabulary foundation deck. Instead, we recommend using the Refold JP1K deck. If however you don't want to pay for the quality and convenience of our deck and wish to stay free only you can check out any of the decks in our community document. "],
      "Field-1": ["Learn about JP1K", "This article explains JP1K and where to get it", "https://refold.la/japanese/deck"],
      "Field-2": ["Stage 1 JP Guide", "Step by step guide on Refold stage 1 specificly for Japanese.", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-VocabApp",
      "patterns": ["Vocab app recomendation", "Vocab apps", "alternatives for anki"],
      "responses": ["We don't recommend any vocabulary apps other than Anki. No other app we know of lets you sentence mine the way that tools developed for Anki can. So even in the beginning, when you are working through a premade foundation deck, you should be using Anki and getting to learn the program in preparation for sentence mining."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-TimeTrackingApp",
      "patterns": ["how to track time", "time tracking app"],
      "responses": ["Everyone has their own way, but here are a couple options our members like using."],
      "Field-1": ["Polylogger", "A Time tracking app specifically for language learning. Available on web and mobile.", "https://polylogger.com/auth/login"],
      "Field-2": ["Toggle", "A general time tracking solution. Available on web and mobile.", "https://www.toggl.com/track/"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-MobileTools",
      "patterns": [""],
      "responses": [""],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-ShouldIUseMorphman",
      "patterns": ["What is morphman", "should I use morphman", "is morphman good", "can i use morephman", "is morphman recomended"],
      "responses": ["**__Thoughts on morphman and the two camps__**\n\nMorphman is an addon for Anki that attempts to find 1T sentences from a sentence bank. Thoughts on this are split.  So I'll go over the pros and cons, and you can make your own choice.\n\n    Pros Camp:\n1. It makes sentence mining quick.\n2. Perfect for people with not a lot of time\n3. Can use frequency list to find useful words easily.\n\nCons Camp:\n1. Time save is an illusion as all-time sentence mining is not immersion (as opposed to finding sentence while immersing)\n2. Morphman can be buggy. It often shows you words you have already marked known. Sorting through this wastes more time.\n3. Sentence context is not as concrete and leads to a weaker understanding of the word.\n4. Once you have a little sentence mining experience, mining in immersion is faster and leads to better sentences.\n5. You are often given 2T+ sentences that appear 1T that make the sentence not very high quality to use.\n\nIn the end, it's up to you if you use morphman or not. My Creator (Brett) and many in the server don't like using it. He used to live by it and refused to not use it. When it broke on him, he was forced to sentence mine during immersion, and this was the best thing that happened to him. Being forced into it made him realize how much better an experience it is. However, many also disagree with this and enjoy the addon."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-ToolsForMobile",
      "patterns": ["Tools for iPhone", "Tools for android", "sentence mining on iphone", "sentence mining on android", "tools for mobile", "sentence mining on mobile", "can I immerse on mobile", "can i sentence mine on mobile", "can i sentence mine on iphone", "study on mobile"],
      "responses": ["As far as immmersion goes, you can do all sorts of things on any mobile phone. You could read books and use built in or third part dictionaries. You can watch Netflix on mobile using the base app, or YouTube. Immersion can be easy. But what about sentence mining and lookup tools.\n\nThere is a tool developed for Androidi by a member of the Refold comunity that I have linked below. This allows for sentence mining and lookups on mobile. Sadly there is no equivelent for iPhone (any devs out there want to port the Android app linked below, post it in the Discord.). Reading lookups and sentence making are possible with the Anki app on and just simple copy paste on iPhone, but for now there is no multimedia card creation tools sadly. Only for android.\n\n(Note: There are always to make it work. On iPhone you can listen to your immersion and try and look up words you don't know just by looking up words by hand in the dictionary. Don't let the tools be the reason you don't continue forward. They are nice, but not nessesary. Get your immersion however you can."],
      "Field-1": ["Jidoujisho", "Android tool for immersion and sentence mining.", "https://github.com/lrorpilla/jidoujisho"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Anki-LowKeyAnki",
      "patterns": ["What is low key anki", "where can I get low key anki"],
      "responses": ["Low key Anki was an old set of addons to make Anki more productive for language learning purposes. However, the addons are no longer recommended as Refold has developed a method to accomplish the same benefit without addons. This is great because you don't have to worry about the addons being kept up to date; also, it works on mobile. I've linked the Refold recommended settings to accomplish this."],
      "Field-1": ["No Addon low key anki", "Here are the settings.", "https://refold.la/roadmap/stage-1/a/anki-setup#Recommended-Options-Settings"],
      "Field-2": ["More low key anki info", "This part of the article explains low key Anki in more depth", "https://refold.la/roadmap/stage-1/a/anki-setup#Low-key-Anki"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },