   {"tag": "Content-WhatShouldIWatch",
    "patterns": ["What should I watch", "What content should I concume", "What content should I watch","What anime should I watch", "What manga should I read", "what books should I read", "what should i use for immersion", "what should I immerse with", "what immersion content should I use", "What's the best material to immerse in", "what's the recomended material to immerse with", "what stuff is good for immersing in in the beginning", "what stuff is good for immersion for a beginner", "what should i immerse in when i just started out", "What’s the best anime to start immersion with", "what type of content should I be immersing with", "what type of content can I immerse with", "what type of content should I be immersing in", "What should i watch when immersing", "What content recomendations", "Does it matter what content I choose for immersion", "What input should I use", "Reading recommendations", "Which resources should I use to immerse", "What should I immerse in", "How do I find easy content", "What to watch first", "what are the best Japanese shows for young kids", "what are some Japanese kids shows", "Which youtube channels should I watch", "YouTube recomendations", "What are youtube recommendations for beginners", "beginner immersion", "Shows", "movies", "podcasts", "anime", "content", "How to find media", "how to find content", "manga", "manga suggestions"],
    "responses": ["What content to consume is a tricky question to answer and changes based on many things. The article linked below will help you figure things out.\n\n Beyond reading the related articles, here are some things to help you find content.\n\n1. Always prioritize your interests over any hypothetical, optimal path. The more you are interested in the content, the better your focus engagement will be, which is essential to making gains.\n\n2. The Media share section allows you to ask for recommendations, discuss content you consume, and look through the archive to see what others have recommended. Head on over to <#783082970432536608> to gain access to the media share channels.\n3. Finally, check out the community document (linked below) to find content recommendations and resources for all stages.\n\nStage 1 Note: For people in stage 1, we generally recommend focusing on audiovisual content. Anime can be powerful in this stage as it is often more clearly spoken than natural content. The visuals will help you stay interested and engaged with the content during the early phases while comprehension is low. Also, your ear probably won't even hear much of the language correctly in this early stage. By focusing on audio-based content with visuals to keep you interested, you can train your ear to listen to the sounds of the language. At the same time, you chip away at your foundation vocab and grammar."],
    "Field-1": ["Beginner Content", "Refold content document beginner content link", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.8yfmnxgwlm0f"],
    "Field-2": ["Leveled Content", "Refold content document, link to resources for leveled content", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.u6th3dd52mlp"],
    "Field-3": ["Turtle TV", "Language Reactor attempts to provide level appropriate content.", "https://www.languagereactor.com/video/ja/pump_ja_1"],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"",
    "context_set": ""
   },
   {"tag": "Content-WhereCanIFindContentWithSubtitles",
      "patterns": ["How can I download anime with accompanying subtitles", "Where can I find movies with subtitles", "where can I find anime with subtitles", "How can I get anime with subtitles", "how can I get movies with subtitles", "How can I get content with subtitles", "where can I find content with subtitles", "Where can I find japanese subtitles", "How to find Japanese subtitles", "where do I get subtitles", "where to get subtitles", "where do i get subtitles"],
      "responses": ["Finding content with subtitles can sometimes be challenging. But here are some primary places to try.\n\n**Streaming Services with subs**\nStreaming services like Netflix and Animelon have a lot of content with matching subs. You can use tools like \"FlixGrab+\" (google it) to download content from Netflix, and \"Subadub\" a chrome and firefox extension to download or select subtitles for easy lookups.\n\nSome content will have Japanese subs available in your country, especially Japanese content that are Netflix originals. But a lot more content will have Japanese subs if you use a working VPN to access Japan Netflix. Check the Refold community document to see which VPN's are currently working.\n\n**Download and find subs / Sub repositories**\nWebsite like Nyaa.si have a lot of Japanese content. Some content will have Japanese subs, but for other content, you will have to find subs. The Refold content and resources community document has a list of subtitle repositories that have subtitle files for thousands and thousands of shows and movies. If the subtitle files don't match, you can check the Tech and Tools document for tools that will help you retime subtitles to fit your media.\n\n**YouTube content**\nThe majority of YouTube content has computer-generated subs. These can be very inaccurate and should not be trusted very often, but just used as a guide. However, some YouTube content does have human-made subtitles. If the subtitle file says \"Japanese\" and not \"Japanese (auto-generated)\", then the subs are probably human-made and can be trusted more. I've linked below a source for finding some human made YouTube subbed content.\n\n** Non-Native Japanese content**\nDubed content subs often don't match. Be careful."],
      "Field-1": ["YouTube content with subtitles", "Content document with subtitled content listed", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.ps5m4ouoy443"],
      "Field-2": ["Subtitle Repositories", "Content and resources for all stages of the process including streaming sites, download sites and subtitle repositories", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.3sos0jj0agsw"],
      "Field-3": ["Tech and tools document", "Tech and tools to help in your journey including subtitle re-time tools.", "https://refold.link/Tech_and_Tools"],
      "Field-4": ["Language Reactor", "Chrome extension to help immersing on Netflix, YouTube and more", "https://www.languagereactor.com/"],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What are some good Netflix VPNs?",
      "context_set": ""
     },
     {"tag": "Content-HowAccessNetflixJapanese",
      "patterns": ["How do I watch Netflix in Japanese", "how do I access Japan netflix", "What VPN's work with netflix", "What VPNs work with netflix",  "whats a good VPN", "what are recomended VPN", "What vpns work with netflix", "whats the best vpn", "netflix vpn", "vpn"],
      "responses": ["Almost every country has content in Japanese. Netflix Originals like Terrace House are available in almost every country. However, Japan Netflix has many more options and a lot more options with Japanese subtitles as well. To access Japan Netflix you need to use a VPN that works with Netflix. Most VPN's do not work with Netflix, and even the ones that do sometimes will stop working temporarily, so check out the document I linked below to get a list of reportedly working VPN's. (Note that these VPN's can stop working or go down temporarily at any time.)"],
      "Field-1": ["Refold content and Resource document","List of content and resources to help you during every stage of the process.","https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.o9qy9yt2k7f9"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Content-IsAnimeOkayCanIAnime",
      "patterns": ["Is anime bad for learning", "is it okay to immerse in anime", "my friend said anime is bad for langauge learning, is that true"],
      "responses": ["Learning Japanese from Anime is perfectly fine. There are many reasons for this. First off being, if you enjoy anime, then anything that causes you to enjoy your immersion and be engaged in it is incredibly valuable. On top of that, anime voice actors often speak pretty clearly, making the early stages of immersion easier to understand. That being said, anime often has unique language use that most people would not use so once your comprehension is a high level and you move onto stage 3 for output/speaking, you will want to start engaging with more natural speech. But we'll worry about how to do that once we get there! Until then, enjoy your anime!"],
      "Field-1": ["Japanese from Anime", "MattVsJapan take on learning  Japanese from anime.", "https://www.youtube.com/watch?v=V9ND6uw6-QA"],
      "Field-2": ["Learn Japanese from Anime", "Another MattVsJapan video on the subject.", "https://www.youtube.com/watch?v=rQtzQQ6I4LE"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Content-IsMusicGoodImmersion",
      "patterns": ["is music a good source of immerison", "is music good immerison", "can i immerse with music", "should i use music for immersion", "can i use music for immersion", "is listening to music passive immersion", "is listening to music immersion"],
      "responses": ["Any immersion is better than none. Furthermore, enjoying the language is essential. That being said, music lyrics are often very poetic, grammatically unnatural and useless for pronunciation and pitch accent. Because of this, it's not recommended as a high-quality source of immersion."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Content-AreVideoGamesGoodImmersion",
      "patterns": ["can I immerse with video games", "are video games good immersion", "is it okay to immerse in video games", "is it okay to immerse with video games", "how are video games for immersion"],
      "responses": ["Most video games are not as valuable for language learning because the language density is low. You can also enjoy games without understanding what is being said at all. But if you're gonna spend your time playing games, you might as well do it in your target language. Just don't expect significant language gains from this. The exception are visual novels, and some JRPG's. All games are different though, so use your own judgement. In general you want immersion sources with as much language density as possible. Over time, it really does matter.\n\nThat being said, if you are going to play video games, having passive immersion in the background can help. When the game provides little to no active immersion, switching focus to your passive immersion can increase your overall language exposure. It's not as good as language-dense active immersion, but it helps."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Content-WhereCanIFindJapanesebooks",
      "patterns": ["where can I find books in japanese", "where can I find Japanese books", "where can I find light novels", "where can I find books", "where can I buy books", "where can I find Japanese light novels", "Where can I find books"],
      "responses": ["First, I recommend checking out the community document for any possible resources, as well as the <#797749820616998932> channel. If you can't, see the <#797749820616998932> then head over to <#783082970432536608> channel to gain access to the media share channels. Another resource is Japanese amazon. Amazon has tons of digitally buyable and downloadable books available for purchase. For more details, please check out the tutorial I linked below."],
      "Field-1": ["BritVsJapan Japanese Books Guide", "This goes over a lot of the ins and outs of finding Japanese books.", "https://www.britvsjapan.com/a-guide-to-buying-books-that-are-written-in-japanese/"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Content-HowdoICombineContentWithSubtitles",
      "patterns": ["How do I combine anime with subtitles", "how do I combine content and subittles", "how do I add subs to anime", "how do I add subtitles to anime", "how do I add subs to content", "how do I add subtitles"],
      "responses": ["If you have media files downloaded and subtitles to match and are wondering how to combine them, then I recommend getting a media player such as VLC media player. Programs like that allow you to load external subtitle files to be used. Most modern media players have this functionality, however, so use the media player of your choice. If you wish to find content with subtitles or want to find out where you can find Japanese subtitles check out the additional questions below."],
      "Field-1": ["VLC Media Player", "Great all around media player.", "https://www.videolan.org/"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"Where can I find content with subtitles",
      "context_set": ""
     },
     {"tag": "Content-WhereCanIFindJapaneseYouTubeVideos",
      "patterns": ["Where can I find Japanese YouTube videos", "how do I find Japanese YouTube videos", "How do I find Japanese YouTube content", "how do I find youtube content", "where do I find youtube content", "Where can I find YouTube videos in Japanese"],
      "responses": ["Some ways to find Japanese YouTube content is as such.\n\n**1. Make a Japanese content-only YouTube account**\nCheck out Matt's video I linked below to learn how to create a Japan YouTube account. On this Japanese content YouTube account, you should ONLY watch Japanese content. This will train your algorithm to recommend mainly Japanese content to you. This will provide a stream of recommended Japanese YouTube content for you.\n\n2.Check the YouTube content section of the discord**\nYou can find other YouTube content members have recommended over in the YouTube content share channel here : <#797749770529669130>. After making your Japanese YouTube content, finding some initial content from that channel can also help get your algorithm going. If you can't see the <#797749770529669130> channel, then check out <#783082970432536608> to learn how to gain access."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What should I watch?",
      "context_set": ""
     },
     {"tag": "Content-SinglePeiceOfMediaRepeatedMedia",
      "patterns": ["single piece of media as the origin of their studies", "Can I master a single peice of cotent", "is it okay to watch the same show over and over", "is it okay to watch a single peice of content over and over"],
      "responses": ["This is not recommended. We recommend mostly being focused on using your active immersion time on new, novel media so you are constnatly exposed to new **low hanging fruit** rather than forcing yourself to have to cram vocab and elements that are out of your range at the moment. There are many more reasons for this as well, but it's a lot to get into now. However, turning content, you watch during active immersion into an audio version of itself and then listening to it over and over in passive immersion for continued exposure is highly recommended. Especially early on."],
      "Field-1": ["Condensed Audio for Passive", "MattVsJapan going over condensed audio.", "https://www.youtube.com/watch?v=QOLTeO-uCYU"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Content-GradedReaders",
      "patterns": ["Should I use graded readers", "What are graded readers", "Can I use graded readers", "where can I find graded readers", "what are some good graded readers", "Graded readers"],
      "responses": ["Graded readers are books and stories that are categorized to attempt to progress through difficulty levels. Graded readers are a fine introduction to reading but aren't necessarily recommended by Refold. We believe you should always prioritize how much you enjoy your immersion over any type of hypothetical, optimal content. If you enjoy the process, you will be more engaged and get a lot more from your immersion.\n\nThat being said, some people love graded readers because they can easily find content that they can have a chance of understanding. If that is the case, then feel free to use graded readers in the early stages. But we recommend trying to move away from them as soon as possible. Others, however, enjoy content based on visuals or what little of the story they can understand, even if it's more complicated. Hunting for that low-hanging fruit and listening for the stuff they DO understand is engaging and fun for them. For those types of people, most likely graded readers will not be very useful.\n\nWe have some graded readers listed in the comunity doucment (linked below) if you decide you enjoy them."],
      "Field-1": ["Refold Japanese content resource document", "Resources and content for every stage of the process", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.66dzfll890s3"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How to start reading?",
      "context_set": ""
     },