   {"tag": "Grammar-HowDoILearnGrammar",
    "patterns": ["How should I learn grammar", "How do I learn grammar", "How does grammar work", "How do I implement grammar", "How long should I spend learning grammar each day", "how long should I do grammar everyday", "Should I do grammar drills", "how to study grammar", "How do I study grammar properly"],
    "responses": ["Refold recommends casually browsing a beginner grammar resource for 10-20 minutes daily to help jumpstart your immersion comprehension. However, we highly caution against  \"studying\" the grammar or doing \" grammar drills\". Instead, browse the concepts and try to understand the example sentences. Then lookout for these concepts in your daily immersion to further solidify them. This Refold article on the website should give you more details on how to handle grammar. (linked below)\n\n(Note: Do what works best for you, but we think doing 5 min of grammar browsing every hour of immersion until you reach that 10-20 minutes per day is the best strategy."],
    "Field-1": ["Refold Grammar Article", "Refold's article on how to learn grammar", "https://refold.la/roadmap/stage-1/c/grammar"],
    "Field-2": ["", "", ""],
    "Field-3": ["", "", ""],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"What should I use for grammar?",
    "context_set": ""
   },
   {"tag": "Grammar-WhatGrammarGuide",
    "patterns": ["What should I use for grammar", "What grammar guide should I use", "What's a good grammar resource", "What grammar resource do you recommend", "what grammar source is recommended", "where can i find good grammar guides", "What is the best textbook after Genki", "What is the best textbook", "which grammar guide do I read", "grammar guide", "where to study grammar"],
    "responses": ["As of now, there are no official grammar guides from Refold. In reality, it's' more about HOW you use the resource rather than what resource you use. That being said, the most widely used grammar resources in the community are most likely \" Tae Kim's Grammar Guide\" and \"Cure Dolly\". There are also other resources linked in the \"Refold community document\" (all resources linked below). \n\nJust be sure to not get caught up in old traditional learning habits. Don't try and \"master\n the concepts or do grammar drills. Just casually browse the guide of your choice and attempt to understand the example sentences. That combined with daily immersion will solidify these concepts over time. We recommend you refresh how to learn grammar properly by reading the Refold Grammar article (linked below)."],
    "Field-1": ["Tae Kim's Grammar Guide", "One of the more used free grammar resources for Japanese.", "http://www.guidetojapanese.org/learn/"],
    "Field-2": ["Cure Dolly YouTube", "A popular, some love it, some hate it YouTube channel.", "https://www.youtube.com/channel/UCkdmU8hGK4Fg3LghTVtKltQ"],
    "Field-3": ["Refold Comunity document", "Find and share content and resources for every stage and level, including grammar resources.", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.q2hyxma7kogy"],
    "Field-4": ["Refold Grammar Article", "Refold's article on how to learn grammar", "https://refold.la/roadmap/stage-1/c/grammar"],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"How do I study grammar properly?",
    "context_set": ""
   },
   {"tag": "Grammar-AddGrammarToFlashcards",
    "patterns": ["Can I add grammar to flashcards", "should I make grammar flashcards", "should I make grammar cards", "should i make cards for grammar", "should I add grammar to anki", "are there any good grammar decks", "what is a good grammar anki", "would it be good to have a grammar anki deck"],
    "responses": ["It is generally not recommended to make grammar flashcards. Basic grammar is so common that just browsing basic grammar daily, combined with immersion, should be enough to solidify the concepts.\n\nOne thing that might help is by focusing on a section at a time. Work to the end of the section and then start over until you feel somewhat comfortable with most of the concepts in that section, then move on. Don't try and master the section before moving on. Try and get the ideas primed in your head and feel confident that you would recognize them even if you don't remember what they mean.\n\n With that being said, it's not the worst thing in the world to add grammar to flashcards. It's not recommended, but if you really are motivated to, then go for it. But force the urge to \"study\" grammar. Instead, just add the example sentences and only put enough notes on the back of each card to understand that one sentence. Don't try and master every nuance and usage of that grammar point in one card. Just understand the sentences."],
    "Field-1": ["", "", ""],
    "Field-2": ["", "", ""],
    "Field-3": ["", "", ""],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"How should I learn grammar?",
    "context_set": ""
   },
   {"tag": "Grammar-HowMuchGrammarShouldILearn",
      "patterns": ["how much grammar should I learn", "should I learn more grammar after TaeKim", "how do I learn more grammar after basic grammar"],
      "responses": ["Refold recommends focusing on getting a basic grammar foundation. This would be the equivalent of something like Tae Kim's grammar guide. Beyond that, we don't recommend focusing on grammar study. Instead, we recommend focusing on immersion and slowly working out what grammar structures mean from context. You can, if really curious, occasionally look up grammar concepts you come across in google; however, we recommend doing this sparingly and instead rely on immersion to solidify most additional grammar. After a basic grammar foundation, we think it's okay to do some actual grammar study after you are fluent and to study it IN Japanese from Japanese grammar resources. But this is also optional."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I study grammar properly?",
      "context_set": ""
     },
     {"tag": "Grammar-WhatIsGrammar",
      "patterns": ["What is grammar"],
      "responses": ["Grammar means something different to everybody, but in short, it is the structures and rules that attempt to explain how a language functions. Most people think languages are build from these rules, but, in reality, the rules are created by grammarians FROM language as a way to try and explain how it functions. They look at how language is used and then look for patterns and rules from usage. This is why there are so many acceptions and quirks in grammar rules and why it makes no sense to learn a language like math, where grammar rules are the equations. This does not work."],
      "Field-1": ["Refold grammar article", "Refol's article talking about grammar.", "https://refold.la/roadmap/stage-1/c/grammar"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I learn Grammar?",
      "context_set": ""
     },
     {"tag": "Grammar-HowDetailedShouldIKnowGrammar",
      "patterns": ["how much of the grammar guide should i remember", "how much should I study grammar", "how detailed should i do grammar", "should I do grammar drills", "how well should I know grammar", "should I memorize grammar", "how intense should I learn grammar"],
      "responses": ["We don't recommend getting detailed with grammar. Instead, just focus on understanding a general idea of basic grammar concepts and then, like a detective, hunt down usage in your immersion and pay attention to how it's used. Slowly, over a LONG period, these grammar concepts will solidify more and more, eventually understanding every nuance and gaining a 6th sense for their complex acceptions and usage quirks."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I study grammar properly?  /  What is grammar?",
      "context_set": ""
     },
     {"tag": "Grammar-DoesImmersionHelpWithGrammar",
      "patterns": ["does immerison help with grammar", "does immersion teach grammar"],
      "responses": ["Yes, immersion helps with every aspect of learning a language."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Grammar-WhatIsParticle",
      "patterns": ["What is a particle"],
      "responses": ["Teaching you Japanese is beyond the scope of me and this discord. I recomend checking out FAQ#1 for our possition on these types of questions. But if you ask me HOW you should learn grammar, and ask me method questions, the answer to this question will reveal itself."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I learn Grammar?",
      "context_set": ""
     },
     {"tag": "Grammar-AllGrammarQuestions",
      "patterns": ["How do I use adjectives", "What are adjectives", "what are nouns", "what are na adjectives", "what are i e adjectives", "what are verbs", "how do verbs work", "how do you conjugate verbs", "what is past tense", "what is a copula", "what the difference between は and が", "What is juukugo"],
      "responses": ["I'm sorry but I don't answer these types of questions. I am mostly concerned about helping peopple learn the method for language learning. Specific grammar questions should be learned through google, your basic grammar guide, and eventually, through immmersion. See Related Questions."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How do I learn Grammar?",
      "context_set": ""
     },
     {"tag": "Grammar-FormalInformalSpeachKeiko",
      "patterns": ["Should I learn formal speach", "do I need to learn formal speach", "should I learn informal speach", "should I learn Keigo", "do I need to learn keiko", "Do i need to learn difference between formal and informal speach", "Formal spepach", "informal speach", "should i learn the difference between formal and informal speech", " should i learn the difference between polite and informal speech", "should i focus on polite and casual langauge"],
      "responses": ["We don't recommend focusing on these details. Instead, just focus on understanding your immersion. Pay attention to the situation. The relationship between the person talking and who they are speaking to. Over time, you will begin to understand the difference between formal, informal, slang, polite, Keigo, and everything up, down, and in-between. Rather than worrying about the rules of politeness, build a 6th sense for it. This will take a long time. Years and years, but it will happen. Once you are functionally fluent, if there are any grey areas you still can't figure out, you can always ask native Japanese speakers for their input IN Japanese. Until then, don't focus on the things you cant figure out on your own and keep hunting for low-hanging fruit. "],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Grammar-ShouldIuseGenki",
      "patterns": ["should I use Genki", "can I use genki", "is it okay to use genki", "is genki good", "Can I use genki for grammar", "do you recommend reading textbooks", "should I buy a textbook", "is minna no nihongo good"],
      "responses": ["We don't recommend using Genki (or any paid grammar book). Free resources like TaeKim's guide are more than enough of a grammar foundation for an immersion learning approach to language learning. However, you pay a premium for Genki in order to gain access to all the drills and lessons that are precisely the methods we recommend staying away from. We don't recommend doing grammar drills, so paying extra for them just to avoid using them seems like a bad idea. However, if you already have the book and want to use it, as long as you focus on browsing the grammar explanations, understand the example sentences, skip over all the grammar drills, and then go for it."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I use Grammar?",
      "context_set": ""
     },
     {"tag": "Grammar-WhatIsTaeKim",
      "patterns": ["What is TaeKim's grammar guide", "what is TaeKims", "should I use TaeKim's", "What is tae kim", "who is tae kim"],
      "responses": ["I don't know who Tae Kim is, but Tae Kim's grammar guide is one of the most widely recommended and used foundational grammar guides in the Japanese Language learning community. It is one of the foundational grammar guides we recommend using to gain a foundation in the language and jumpstart comprehension. But make sure you are using it correctly and following our advice on best studying grammar in an immersion method."],
      "Field-1": ["Tae Kim's Grammar Guide", "Widly used Japanese grammar guidie", "http://www.guidetojapanese.org"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I study grammar properly?",
      "context_set": ""
     },
     {"tag": "Grammar-IsStudyingGrammarImportant",
      "patterns": ["is studying grammar important", "how important is grammar", "is grammar study necessary", "do I have to study grammar", "is grammar necessary"],
      "responses": ["No, grammar study is not essential. However, we believe getting a foundational grammar understanding by casually browsing a grammar guide will significantly speed up your foundation and jumpstart your comprehension. It only takes 10-20 minutes a day. It could save you years off the process to get you that essential foundation and reap the max benefits of immersion faster."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I study grammar properly?",
      "context_set": ""
     },
     {"tag": "Grammar-ConjugationsLearn",
      "patterns": ["do I want to study conjugations", "should I study verb conjugations", "should I study conjugations", "how do I learn conjugations"],
      "responses": ["Conjugations in Japanese can get very complicated. Learning the complex rules behind how to conjugate from the base form is not something we recommend. Instead, just learn to recognize its already conjugated form. For example, almost all verbs ending in た (EX:食べった) will be the past tense. You don't need to memorize all the rules that get you from 食べる to 食べった, all you have to do is learn to recognize that it is the past tense. YOu will then use this comprehension and ability to understand its meaning to form instincts around the conjugations as a native does."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },