      {"tag": "immersion-WhatDoIDoDuringImmersion",
      "patterns": ["What do I do during immersion", "How do I immerse", "what should I focus on during immersion", "what do I focus on during immersion", "How to immerse", "how to do active immersion", "What do I do for immersion as an absolute beginner", "what do i do in immersion"],
      "responses": ["What exactly you do during immersion is hard to explain. The video linked below attempts to clairify this, but here is the answer in short. Do whatever you have to do to understand what you are consuming. This does not mean stop and look up every word you don't know to try and understand everything you are consuming. This is not advised to do often. This means to focus on the element preventing you from understanding your immersion.\n\nIn the beginning, this will be the sounds of the language. When you first start, you won't be able to hear the language properly. Most of it will sound like gibberish, so your focus should be on listening as intently as you can to listen to the sounds of the language. Once you start hearing the sounds better, you will begin to start picking out words. Some of the words you will recognize from your flashcards. Others will just be words you have heard in your immersion a lot and stick out. Words will eventually turn into sentences and into groups of sentences, scenes, and ultimately entire stories.\n\nIf you are still confused, try watching the video linked below and ask me some of the related questions. Good luck!"],
      "Field-1": ["What do we do during immersion", "A video attempting to explain what exactly we do during immersion", "https://youtu.be/m0GfLNQeRvI?t=705"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How much should I understand?  //  When should I start immersing?",
      "context_set": ""
      },
      {"tag": "immersion-HowMuchImmersion",
      "patterns": ["How much should I immerse everyday", "how much immersion should I do", "what is the least amount of immersion hours", "what is the least amount I can immerse", "What is the recommended daily immersion time", "How much immersion should I do a day", "how much immersion do a day", "how much immersion per day", "How much immersion", "How much to immerse", "How much immersion a day", "how often should I immerse", "how often should I be immersing", "How much do I need to immerse", "How much should I study", "how long will it take to learn japanese", "how long does it take to learn japanese", "when i become fluent", "How long to fluent", "How long do I need to immerse to become fluent", "How quickly can I learn Japanese", "how many hours of immersion", "How much time does it take to get fluent", "How long should I immerse", "How long", "Time to reach fluency", "how much should I immerse each day", "How much shod I be immersing", "What is the minimum active immersion requirement"],
      "responses": ["**__How long will this take? How much should I immerse?__**\n\nThe short answer is every day and as much as you can without negatively affecting more essential things in your life, like health, job, relationships, etc. The more detailed answer is.\n\nThis is a complicated answer because, in the end, we just don't know. Everyone learns at different rates. It also depends on the quality of your immersion, how well you are at keeping focus, your goals, and many more factors. Assuming you don't speak any other Asian languages, you can assume it will require a significant amount of immersion to reach a high level. That being said, here are some basic benchmarks. (These estimates are a guide only and differ from person to person significantly)\n\n**3 Years to Speaking**\nWe advise getting at least 3+ hours of active immersion and another 3+ hours of semi-active/passive immersion a day to reach the output stage within 3 years. However, by Refold standards, at this point, your comprehension level will be so high that you will already be at a higher level in the language than most ever accomplish.\n\n**Minimum amount**\nWe do recommend trying to get a minimum of 2 hours of active immersion a day. Anything 1 hour or less likely won't lead to satisfactory progress in a language like Japanese.\n\n**There is no limit but be careful**\nThe more you immerse, the faster your progress will be. So if you have time, always opt to get more exposure to the language and hunt down ways to add more immersion time. But don't sacrifice physical or mental health, relationships, your job, and other more important things. Learning a language is excellent, but it won't make your life suddenly perfect. Once you speak the language, you want a life and people to enjoy it with."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
      },
      {"tag": "Immersion-TooMuchImmersion",
        "patterns": ["How much is too much immersion", "can you immerse too much", "what is the most I should immerse", "what is the max amount of immersion I should do", "is there such thing as too much immersion"],
        "responses": ["The short answer is, there is no such thing as too much immersion. The more immersion you do, the quicker your gains will be. That being said, make sure you have a healthy life outside of immersion. Don't sacrifice more important things like health, safety, relationships, job, future, etc. Learning a language is fantastic, but it won't make your life magically better, so make sure you have a healthy life outside of immersion. But with that being said, assuming the above is being protected, the more, the better."],
        "Field-1": ["", "", ""],
        "Field-2": ["", "", ""],
        "Field-3": ["", "", ""],
        "Field-4": ["", "", ""],
        "Field-5": ["", "", ""],
        "Field-6": ["", "", ""],
        "Related-Q":"",
        "context_set": ""
       },
        {"tag": "Immersion-WhatIsActiveImmersion",
         "patterns": ["What is immersion", "What is active immersion", "what is intensive immersion", "What is free flow immersion", "What are some examples of active immersion", "what is free flow what is intensive immerison", "What is immersion", "What's intensive immersion", "how to do intensive immersion", "intensive immersion", "active immerision", "What is free-flow immersion"],
         "responses": ["Immersion is simply consuming content in your target language (TL) created by natives for natives. Active immersion is immersion where you are entirely focused with the intent to understand it. Your attention isn't divided between other tasks, but rather you are fully dedicated to understanding the content you are consuming. So watching Anime, Movies, reading novels, light novels, watching YouTube videos, and more, are all examples of active immersion. In Refold, we break active immersion up into two types. **Intensive immersion** and **free flow** immersion. Learn more about active immersion and the two types of active immersion in the articles linked below. "],
         "Field-1": ["Active Immersion", "Refold article going over the basics of active immersion.", "https://refold.la/roadmap/stage-0/c/active-immersion"],
         "Field-2": ["Types of Active", "Refold article going over the two types of active immersion in the Refold method.", "https://refold.la/roadmap/stage-2/a/types-of-active-immersion"],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What do I do during immersion?",
         "context_set": ""
        },
        {"tag": "Immersion-WhatIsPassiveImmersion",
         "patterns": ["What is passive immersion", "what is semi active immersion", "how much passive should I do", "how much passive immersion should I do", "how much semi active should I do", "how much semi active immersion should I do", "What's passive immersion", "What's passive listening", "What's a good active vs passive immersion ratio", "How much active immersion compared to passive immerison", "How much passive listening should I do each day"],
         "responses": ["Passive immersion (also sometimes called Semi-active immersion) is any immersion you do when you arent 100% focused on immersion. So this would be immersion when doing laundry, working out, cooking, driving, brushing your teeth. Whatever. The article below goes over passive immersion. But there are two things I want to clarify.\n\n**How much passive immersion should I do?**\nYou want to do as much passive immersion as you can without sacrificing more important things, such as mental/physical health, safety, relationships, your job, etc. That being said, you NEVER want to sacrifice active immersion for passive. Passive immersion is only something you do when you are unable to do active immersion. \n\n**Passive immersion is misleading**\nPassive immersion is a word created to let people know they can always find ways to fit more exposure to the language in, even if they can't fully focus. But in reality, focus is not binary; it's not on or off, black or white. It's a gradient. Sometimes during active immersion, you will lose focus and drift into passive. Other times during passive, you will focus in and get some active. The main thing is, you want to get as much exposure with as much focus as humanly and safely possible in the moment."],
         "Field-1": ["Refold Passive Listening", "Refold article on passive listening", "https://refold.la/roadmap/stage-0/c/passive-listening"],
         "Field-2": ["Stage 1 Passive Listening", "Another article touching on passive listening and tools to use for passive listening", "https://refold.la/roadmap/stage-1/a/passive-listening"],
         "Field-3": ["Condensed Audio Repository", "Find condensed audio", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.ehdo4q783uf6"],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What is condensed Audio? // How much should I immerse everyday?",
         "context_set": ""
        },
        {"tag": "Immersion-IsPassiveImmersionEffective",
          "patterns": ["Is passive immersion effective", "how useful is passive immersion", "is passive immersion even worth it", "Is passive listening important"],
          "responses": ["The short answer is yes. The more nuanced answer is, usually. When learning a language,  you want as much exposure to that language as humanly possible without negatively affecting more important things (like health, job, relationships etc). The higher quality your immersion, the more benefit. But anything is better than nothing. If you just have Japanese on in the background and paying zero focused attention to it at all, then no, it's not likely to give much benefit. But who knows, it might provide some minor benefit. But, maybe for 2 hours you don't pay attention to it, then you have 30 seconds where you do focus on it because there is a lull in whatever you are doing. Well, for those 30 seconds, you basically get **active immersion** or at least semi-active immersion. Every little bit adds up over time. It's just up to you to decide if it's worth the effort and sacrifice. I think the related question will provide some more useful information potentially."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"What is Passive immersion?",
          "context_set": ""
         },
        {"tag": "Immersion-HowMuchIntensiveImmersion",
            "patterns": ["How much intensive immersion should I do", "what ratio of intensive to free flow should I do"],
            "responses": ["Intensive immersion is recommended to be a supplement to free flow immersion. While it is a powerful tool, you want to be careful about interfering with the natural acquisition process. Because of this, we recommend 30 minutes of intensive immersion a day. If you feel you want to do more, then go ahead and do more. Just be careful you aren't using intensive immersion as a crutch because you can't accept ambiguity. Even with intensive immersion, accepting ambiguity is an important element of the process.\n\nAnother thing to keep in mind, if you have much more passive immersion time than you do active immersion, you may want to do a little bit more intensive immersion during your active immersion and then use your passive immersion as the majority of your free flow exposure. But even if this is the case, make sure you are getting a healthy amount of free flow immersion during your active immersion time as well.\n\nBe extra careful to also not burn out doing too much intensive immersion."],
            "Field-1": ["Refold types of active immersion", "This article goes over free flow and intensive immersion", "https://refold.la/roadmap/stage-2/a/types-of-active-immersion"],
            "Field-2": ["", "", ""],
            "Field-3": ["", "", ""],
            "Field-4": ["", "", ""],
            "Field-5": ["", "", ""],
            "Field-6": ["", "", ""],
            "Related-Q":"",
            "context_set": ""
           },
        {"tag": "Immersion-WhenShouldIStartImmersion",
         "patterns": ["When should i start immersing", "should i immerse from day 1", "i'm not ready to immerse yet", "what if I don't understand my immersion", "when do I start immersing", "do i immerse even on day one", "Should I be immersing while doing the initial decks", "should I immerse during JP1k", "Should I immerse during Tango", "Should I be immersing during foudnation deck", "When is the best time for me to try immersion learning", "is early immersion bad", "is early input bad", "should I imemrse in stage 1", "I can’t immerse yet because I don’t know enough", "immersion is to difficult i'm not ready", "How many vocab words should I learn before immersing", "when to immerse", "should i immerse right away", "should i be immersing while doing decks", "Should i immerse during JP1k", "Should I learn vocabulary before doing immersion"],
         "responses": ["The central part of the Refold system is immersion. Everything else is supplemental. Because of this, we recommend you immersing the very first day you start learning vocabulary. If you need a few days to learn the system, read the articles and watch the videos available, that is fine. But as soon as you start learning foundation vocabulary and grammar, you want to start immersing.\n\nThe video linked below will explain why we recommend immersing so early, even if you don't understand anything. But in short, immersion is where you fully acquire elements that speed up the speed at which you learn and acquire new aspects. Conversely, too much learning without the accompanying immersion to solidify and acquire what you are learning will likely slow down your progress."],
         "Field-1": ["Why we immerse from day 1", "Video I made to clear up some immersion confusion", "https://youtu.be/m0GfLNQeRvI?t=192"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What do I do during immersion?",
         "context_set": ""
        },
        {"tag": "Immersion-HowMuchShouldIUnderstand",
          "patterns": ["How much of my immersion should I understand", "how much should I understand", "is it okay if I understand none of my immersion", "is it okay if I only understand a few words here and there", "what if I only understand a few words here and there", "How much should I understand while immersing", "Do I have to understand the input to immerse"],
          "responses": ["There is no amount of your immersion that you \"should\" understand. We all start at nothing. We all need to train our ears to hear the sounds of the language and won't be able to pick out many of the words we know from our flashcards even. This is normal. So don't worry if you understand anything, don't worry if you can't hear the sounds or the words. Just keep listening and stay focused on the elements preventing you from understanding and train your brain to understand it.\n\nCheck out the video linked below for a more detailed explanation of why we recomend immersing from day 1, even if you understand almost nothing. Also try asking me the related questions."],
          "Field-1": ["Why we immerse from day 1", "Video I made to clear up some immersion confusion", "https://youtu.be/m0GfLNQeRvI?t=192"],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"What do I do during immersion? || When should I start immersing?",
          "context_set": ""
         },
         {"tag": "Immersion-HowMuchShouldIBeReading",
          "patterns": ["How much should I be reading", "how much reading should I do", "what should my ratio of listening to reading be", "how much should I listen", "how much listening should i do compared to reading", "how much reading should I do compared to listening", "what ratio of reading to listenign should i be doing", "When should I start to read a raw book", "when should I start reading", "When do I start reading", "when should i start reading", "When to start reading", "Should I focus more on reading or listening first", "when should I start reading", "When should I read", "When should I start reading Light Novels", "how much should I read", "when should I start reading manga"],
          "responses": ["The answer is different for each stage of the process, so make sure you follow the Refold website's recommended advice. With that being said, here is a short answer. What you chose to read, subtitles, manga, light novels, etc, is up to you. But check related quesitons.\n\nIn stage 1, you want to focus primarily on listening. This way, you train your ear to hear the sounds of the language before associating them to the writing system too much. Watching content with Japanese subtitles isn't exclusively considered reading; it is more a hybrid activity providing clues to what you hear. \n\nIn phase 2, if you chose, you can start reading more. Once you decide to start adding more reading, you want to try and keep your reading and listening comprehension levels somewhat even. So if one gets out of sync, spend more time with that activity to keep them about even.\n\nIt's also important to keep in mind that interests and goals come into play also. Some care more about reading than listening/speaking and vice versa. So spend time with the activity you care about, just know that too much in one direction, or the other will lead to less skill in the other. Find the balance that works for you. For most people, the recommended ratios and method that Refold lays out should work just fine. What you read and when is up to you. See related qeustions"],
          "Field-1": ["How to read a novel", "Refold article covering reading", "https://refold.la/roadmap/stage-2/c/how-to-read-a-novel"],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"How to start reading?",
          "context_set": ""
         },
         {"tag": "Immersion-ReadingListeningBalance",
          "patterns": ["What is a good Reading to Listening balance", "reading and listening ratio", "How do I balance reading and listening", "Reading and listening balance"],
          "responses": ["Once you start reading, which is generally in stage 2, we recommend a 70/30 balance or a 50/50 balance. If one aspect is stronger than the other (for example, if your reading is stronger than your listening), listen 70 and read 30 percent. If the two are somewhat equal in strength, then immerse in a 50/50 ratio.\n\nThis assumes that you want to keep listening and reading balanced, which we recommend. Some, however, want to be more listening dominants and care about reading less. In contrast, others want to be more reading dominants and don't care as much about listening. So in that case, you will have to find what balance works for you and your goals."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"How to start reading?  //  When should I start reading?",
          "context_set": ""
         },
         {"tag": "Immerison-WhatIsMostImportantAspectOfImmersion",
          "patterns": ["What is the most important aspect of immersion", "whats the most essential part of immersion", "What are the most important parts of immersion", "what are the most crutial elements of immersion"],
          "responses": ["Anybody doing Refold for more than a few months knows that immersion is the most critical element of the process. But what are the most essential aspects of the immersion itself? Here are a couple.\n\n**Focus**\nMaking sure you are focused on your immersion fully during active immersion is essential. Don't be checking emails, don't be scrolling social media. Engage in and focused on your content to signal to your brain that this is important. It's impossible to stay 100% focused for hours at a time, but the goal should be to be as focused as humanly possible at all times. Even if all you can muster is glazed eyes after work. Anything is better than nothing, but focus is better than anything.\n\n**Give your brain things to figure out - Be curious**\n You want to watch your content with the intent to understand. The content you consume should be interesting to you. You should WANT desperately to understand it. This will make you hunt down for clues of what things mean. Your brain will take these curiosities and continue trying to figure them out in your subconscious even when you aren't immersing. So don't just go into immersion with the intent to check off your immersion boxes for the day. Remind yourself that this is something you want to understand and enjoy, and then try your best to do it. Even if you fail for a long time."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"What do I do during immersion?",
          "context_set": ""
         },
        {"tag": "immersion-howOftenLookThingsUP",
         "patterns": ["How often should I look things up", "How often do I look words up when immersing", "how often do I look things up", "do I look up everything I don't know", "do I look up every word I dont know", "do I look up every word I don't understand", "should I completely look up everything I don't know or things I might need for the plot", "should I completely look up everything I don't know", "How many words should I look up while doing free flow immersion", "How many words should I look up", "how often should I look up words while reading", "Should i look up every word"],
         "responses": ["The video linked below should help you with that question. But keep in mind that the video mostly talks about Free Flow immersion (which should be the majority of your immersion time). If you are in stage 2 and starting intensive immersion, I will link the intensive immersion article below for that as well.\n\nThe short answer is, you don't want to break up your free flow immersion too often. Looking up a word every 3-5 minutes should be fine. However, during intensive immersion, you want to look up every word you don't know."],
         "Field-1": ["How often to look things up", "Goes over how often to look things up, so you don't break the flow of your immersion", "https://www.youtube.com/watch?v=3mAdzPcxBio&t"],
         "Field-2": ["Intensive Immersion", "Refold article going over intensive immersion", "https://refold.la/roadmap/stage-2/a/types-of-active-immersion#Intensive-Immersion"],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Immersion-UseEnglishSubtitles",
         "patterns": ["Can I use English subtitles", "Should I use english subtitles", "should I use native subs", "Should I use subtitles", "can I use japanese subs", "can I use japanese subtitles", "should I use Japanese subtitles", "are english subtitles okay", "are NL subtitles okay", "can I use TL subs", "should I use TL subtitles", "Should I use subtitles for active immerison", "can I usue subtitles during active immersion", "Should I use subtitles during active immersion", "Should I watch anime with subtitles", "should I watch youtube with subtitles", "should I watch movies with subtitles", "can I watch anime wiith subtitles", "Should I watch anime with japanese subtitles"],
         "responses": ["**English Subtitles/Native language subs**\nIn the beginning using Native language (NL) subs to help build a daily immersion habit is fine. But immersing with NL subs does not offer much benefit in terms of language acquisition. If your mind is focused on reading, it can't focus on the things it needs to focus on to acquire the language.\n\n**Japanese subtitles**\nFollow the recommendation for your stage as laid out in the articles on the Refold website. But in short, we recommend having Japanese subtitles on if you have them early in stage 1 to help provide more information for comprehension during this stage when understanding is low. But starting in stage 2, you will begin to slowly remove this crutch."],
         "Field-1": ["Limit NL subtitle use", "This article goes over use of NL subs", "https://refold.la/roadmap/stage-1/a/active-immersion#Limit-NL-Subtitle-Usage"],
         "Field-2": ["Stage 1 Active Immersion", "Part of this article touches on using english subtitle.", "https://refold.la/roadmap/stage-1/a/active-immersion#Limit-NL-Subtitle-Usage"],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Immersion-HowToPassive",
          "patterns": ["What is good way to passive immerse", "what is good content for passive immersion", "how do I passive immerse", "are podcasts good for passive", "are audiobooks good for passive", "What sorts of content is recommended for passive immersion", "Where can I find resources for passive immersing", "what audio should i use for passive", "what audio for passive"],
          "responses": ["Any audio content is suitable for passive immersion. Podcasts, audiobooks, and even a lot of YouTube content. However, early on, when your comprehension is already low, even when entirely focused, we recommend listening to an audio version of your active immersion content. So once you watch a show, you can turn it into an audio version of the show and listen to it as passive immersion. This gives you more exposure to the vocabulary and concepts you are already learning during active immersion.\n\nThe act of taking a show and turning it into a shorter audio version of itself, with all the dead air removed, is referred to **condensed audio**. I have linked to an old video by MattVsJapan below going over condensed audio; however, the method he shows is now outdated. If you check the Tech and Tools document (linked below), newer condensed audio tools streamline the process. There are also condensed audio repositories in the resource and content community document that contain already made audio files for a lot of content (also linked below)."],
          "Field-1": ["Choosing Passive Listening", "This Refold articles covers some passive listening topics.", "https://refold.la/roadmap/stage-0/c/passive-listening#Choosing-Listening-Content"],
          "Field-2": ["Condensed Audio for Passive", "MattVsJapan going over condensed audio.", "https://www.youtube.com/watch?v=QOLTeO-uCYU"],
          "Field-3": ["Refold Tech and Tools", "Document with tons of tech and tools for language learning", "https://refold.link/Tech_and_Tools"],
          "Field-4": ["Refold Japanese content/resources", "Document with Tons of content and resources for all stages of the process.", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.ehdo4q783uf6"],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-condensedAudio",
          "patterns": ["Where can I find condensed audio", "how to make condensed audio", "where is condensed audio", "where I can download condensed passive audio", "condensed audio"],
          "responses": ["You can get condensed audio in one of two ways. You can find it already made, or make your own. There are many condensed audio repositories in the Refold Japanese community document (linked below). I've also linked a video of Matt going over how you can make condensed audio. However, this method is pretty old, and since then, dedicated tools have been developed to create condensed audio. You can find some of these tools in the Refold Tech and Tools document (linked below)."],
          "Field-1": ["Condensed Audio for Passive", "MattVsJapan going over condensed audio.", "https://www.youtube.com/watch?v=QOLTeO-uCYU"],
          "Field-2": ["Refold Tech and Tools", "Document with tons of tech and tools for language learning", "https://refold.link/Tech_and_Tools"],
          "Field-3": ["Refold Japanese content/resources", "In section 1A, scroll down to \"Passive listening archives (condensed audio)\" section.", "https://refold.link/japanese"],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-HowStartReading",
          "patterns": ["What’s the best way to start reading", "how can I get started reading", "whats the best way to get started reading", "how should I start reading", "How do I begin reading", "how to read a book", "how to read", "childrens books", "good intro to reading", "what are some easy books"],
          "responses": ["It is often recommended to read subtitles as an introduction to reading. Actually pausing before each line, using a tool such as **Language Reactor** (formerly Language Learning with Netflix and reading the line before playing it. This provides a direct feedback loop between what you are reading and how it is pronounced. Manga can also be a good intro to reading but does not provide that accompanying listening practice and reassurance that you are reading it correctly by having a native read the line directly after like subtitles do. I've also linked a stage 2 article on reading novels below, as well as a link to some guided readers, and graded readers and children books for those that want to check those out."],
          "Field-1": ["How to read a novel", "Refold article covering reading", "https://refold.la/roadmap/stage-2/c/how-to-read-a-novel"],
          "Field-2": ["Beginner Manga", "Content beginner document Manga link", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.utn5mvf18i83"],
          "Field-3": ["Guided/Graded readers and childrens books", "Some guided and graded readers as well as childrens books in the content doc.", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.xmbi7o7u7g2x"],
          "Field-4": ["Leveled Content", "Refold content document, link to resources for leveled content", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.u6th3dd52mlp"],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"What are graded readers? // What is Language Reactor?  //  How should I learn Kanji?",
          "context_set": ""
         },
         {"tag": "Immersion-WhatIsImmersionLearning",
          "patterns": ["What is immersion", "what is immersion learning", "what is Language Acquisition", "What is immersion"],
          "responses": ["Immersion Learning is the act of learning a language by consuming native content. Meaning for natives by natives. There is a lot more to it than this, so I recommend you check out all the resources in <#784120941650509865> so you can learn the foundations first. It's a lot to take in, so take it slow and be curious."],
          "Field-1": ["Language Acquisition", "Refold article on Language aquisition through immersion.", "https://refold.la/roadmap/stage-0/a/language-acquisition"],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-WhyShouldIRead",
          "patterns": ["is reading important", "why is reading important", "should I be reading", "how important is reading"],
          "responses": ["Reading seems to be where the most significant gains in pure language ability are formed. However, too much reading and not enough listening is thought to have negative ramifications on pronunciation, pitch accent instincts, as well as a natural use of spoken vocabulary over written vocabulary. However, it does seem to speed up the process quite a bit. This is why Refold recommends balancing the two the way we do. Focusing on listening only during stage 1 to build a solid foundation and then working into a more balanced approach in stage 2 so you get the best of both worlds. However, depending on your goals, you can balance this however you want. Some may want to go more listening heavy, while others may enjoy going more reading heavy. This will be influenced both by your goals and what type of immersion you enjoy most."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-IsReadingEasierThanListening",
          "patterns": ["Is reading easier then listening", "which is easier reading or listening", "is it normal for my reading to be better than my listening"],
          "responses": ["I would say yes. For most people, reading is more manageable than listening. The visual cues that reading gives help support comprehension so much that it takes most people much longer to develop solid listening skills than reading skills. However, while you do have to do a significant amount of listening, to a certain extent, reading will improve your listening as well as it will increase how comfortable you are with sentence structures and vocabulary."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-WhyNoReadingFirst",
          "patterns": ["why should I not read first", "Why does refold recomend only listening at first", "why recomend only listening in stage 1", "why does Refold not have you read early on", "why don't we read early", "why don't we read in stage 1"],
          "responses": ["Refold recommends focusing on listening first and training your ear to hear the sounds of the language before worrying about reading. There are many reasons for this. I'll touch on them quickly.\n\n1. Gives you time to get a kanji foundation. Decks like the Refold JP1K develop a kanji foundation through exposure to kanji in vocabulary but without testing your ability to read the kanji. This gets you familiar with the building blocks of kanji slowly over time. This gives you time to build that foundation before worrying about putting it to use.\n\n2. Train your ear. Your brain likely can't hear all the sounds of the language when you first start. It takes tons of exposure to the language to even hear it properly, so while you gain a vocab and grammar foundation, it's best to work on building your ability to hear the language since you won't be able to understand what you are consuming anyway. Once you have even a 50 vocab foundation, you will start putting those listening skills to great use.\n\n3. There is some evidence that reading too early can create a link in your mind between the sounds of the language and the writing system. This can cause a slightly lagged listening comprehension experience later on because your brain is always relating it to the writing system rather than just processing the sound. Some believe this \"link\" can't be undone. But even if it can, it takes a lot of time, so we feel to help avoid this, it's best to get a solid listening foundation before reading."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"What is JP1k?",
          "context_set": ""
         },
         {"tag": "Immersion-GoodImmersionTools",
          "patterns": ["What are some immersion tools", "what are some good tools for immersion", "What immersion tools do you recommend"],
          "responses": ["All sorts of immersion tools can be found in the Tech and Tools document. Language Reactor (formerly Language Learning with Netflix), Migaku tools, MKV addons to name a few. I've linked the document below."],
          "Field-1": ["Refold Tech and Tools document", "Bunch of tools to help with language learning", "https://refold.link/Tech_and_Tools"],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-HowDoILearnToParseWords",
          "patterns": ["How do you parse words", "how do I learn to parse words", "how do I tell when one word starts and one ends", "how do I learn to parse Japanese sentences", "how do you parse japanese sentences"],
          "responses": ["Parsing words will come over time. As you browse a grammar guide daily and gain a greater understanding of how sentences work, and then learn more and more vocabulary, you will naturally gain an understanding of how to parse sentences and find where the words are."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-WhatsBetterIntensiveOrFreeFlow",
          "patterns": ["What's more important, intensive or free flow immersion", "what's better intensive immersion or free flow immersion", "Do I have to do free flow and intensive immersion"],
          "responses": ["One isn't better than the other. They both serve a purpose. I will say that intensive immersion should be used sparingly. You definitely want to do at least 5 times more free flow immersion than intensive. Intensive immersion helps you process the language at whatever speed you need to pick out new vocabulary and new concepts. However, it can also make you overthink the language and interfere with the subconscious natural language acquisition process. So while it's important to use intensive immersion to bring attention to new concepts, you want to also make sure you are getting a lot of free flow immersion so you are solidifying the stuff you know into automatic, fully acquired, pure language skill."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-WhatIsTheBestWayToImmerse",
          "patterns": ["what is the most effective way to immerse", "what is the best way to immerse"],
          "responses": ["The best way to immerse is with complete focus. Not checking your phone or thinking about the day. Watch your immersion with the intent to understand it. Try and figure it out like a detective. Pretend that if you can summarize whatever scene properly to a friend, you win a million dollars. Hunt down meaning. NEED and desire to understand the story in front of you. It's this type of focus where language acquisition thrives."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immerison-whyImmersionShouldIIsImmerisonRequired",
          "patterns": ["Why should I immerse", "Is immersion useful", "do I have to immerse", "is immersion worth it", "is immersion required"],
          "responses": ["Immersion is the most essential part of the process. It is through immersion that our subconscious begins to form its instinctual understanding of the language. Seeing vocabulary and concepts repeatedly in new, novel contexts signals to our mind that it is important and should be remembered not just in the context of the SRS but all the time.\n\nYou will find that if you don't immerse, you will get vocabulary correct every time in Anki, but then when it comes time to use it, or you see it in a new context, you can't recall it. The brain is VERY context-dependent, so you NEED to give it exposure to all these things you are learning in hundreds and hundreds of contexts. This is just one of the many many reasons why immersion is so important.\n\nDon't fool yourself into thinking study or Anki is where the gains are made. They are a supplement. The true magic is in immersion. Aacquisition of the language."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-REcomendedPassiveContent",
          "patterns": ["What is recommended passive immersion content", "what content is best for passive", "are audiobooks good for passive", "are podcasts good for passive", "where can I get resources for passive immersion", "where can I find good passive immerison content"],
          "responses": ["Any audio content is suitable for passive immersion. Podcasts, audiobooks, and even a lot of YouTube content. However, early on, when your comprehension is already low, even when entirely focused, we recommend listening to an audio version of your active immersion content. So once you watch a show, you can turn it into an audio version of the show and listen to it as passive immersion. This gives you more exposure to the vocabulary and concepts you are already learning during active immersion.\n\nThe act of taking a show and turning it into a shorter audio version of itself, with all the dead air removed, is referred to **condensed audio**. I have linked to an old video by MattVsJapan below going over condensed audio; however, the method he shows is now outdated. If you check the Tech and Tools document (linked below), newer condensed audio tools streamline the process. There are also condensed audio repositories in the resource and content community document that contain already made audio files for a lot of content (also linked below)."],
          "Field-1": ["Choosing Passive Listening", "This Refold articles covers some passive listening topics.", "https://refold.la/roadmap/stage-0/c/passive-listening#Choosing-Listening-Content"],
          "Field-2": ["Condensed Audio for Passive", "MattVsJapan going over condensed audio.", "https://www.youtube.com/watch?v=QOLTeO-uCYU"],
          "Field-3": ["Refold Tech and Tools", "Document with tons of tech and tools for language learning", "https://refold.link/Tech_and_Tools"],
          "Field-4": ["Refold Japanese content/resources", "Document with Tons of content and resources for all stages of the process.", "https://refold.link/japanese"],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-HowDoIGetPassive",
          "patterns": ["how do you get passive imemrsion"],
          "responses": ["Passive is just the act of immersing during activities where you can't focus 100% on the immersion. So when you are doing laundry, working out, cooking, showering, brushing your teeth. Get as much exposure to the language as you can."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-IsIntensiveImmersioniNessesaryRequiredBenificial",
          "patterns": ["is intensive immersion really beneficial", "is intensive immersion worth it", "is intensive immersion required", "is intensive immersion nessesary", "Is intensive immersion that useful"],
          "responses": ["Intensive immersion definitely seems beneficial for most members. We recommend doing some of it. However, if you really don't enjoy it, then keep it minimal. You never, above all else, want to affect your motivation."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-MangaOrNovels",
          "patterns": ["Should I read manga or novels", "Should I read manga or light novels"],
          "responses": ["This is up to you. Manga will generally be a much better intro to reading if you are just starting off (see related questions). But whatever you are motivated to immerse in, follow that motivation. Manga will generally be easier since pictures REALLY help, by quite a large margin, with comprehension early on when you probably need help understanding your immersion."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"How do I start reading?",
          "context_set": ""
         },
         {"tag": "Immersion-HowToImproveListening",
          "patterns": ["How can I improve my listening", "how to get better at listening", "how to improve listening comprehension", "how to be a good listener"],
          "responses": ["Sadly there is no magic secret to this. Listening comprehension is difficult and just requires continuing to immerse in a lot of content, with a decent chunk of that immersion being listening. The more exposure you can get to the language, the faster you will improve."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-HowToLookUpWordsInMangaReading",
          "patterns": ["looking up words in manga", "how do I look up words in manga"],
          "responses": ["Most manga has furigana, so you can just type in the word into your dictionary of choice. However, some also enjoy using OCR, Optical Character Recognition. These are tools that will attempt to read the characters from non-selectable text so you can get a translation or make them a selectable text."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"What is Furigana?",
          "context_set": ""
         },
         {"tag": "Immersion-HowToStartImmersing",
          "patterns": ["How to start immersing", "how do I start immersing"],
          "responses": ["Just do it. Immersion is simply engaging with native content with the intent to understand. You start by starting. I recommend, if you have not already, however, to check out the resources on the Refold website as well as <#784120941650509865> to ensure you are taking the proper steps to get the most out of this time investment."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"Where do I start?",
          "context_set": ""
         },
         {"tag": "Immersion-IntensiveForReading",
          "patterns": ["Should I freeflow or intensive while reading", "Should I use intensive or passive for reading"],
          "responses": ["Both. Intensive and free-flow immersion can both be done with Reading or Listening. Many feel intensive immersion works best with reading, but members do it with listening as well. I recommend finding a balance, do a little intensive with both reading and listening, and see which you like best. Free-flow should be the vast majority of your immersion, though."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },
         {"tag": "Immersion-Stage1Immersion",
          "patterns": ["What do I do when immersing in stage 1", "How do I immerse in stage 1", "what do i do when immersing in stage 1"],
          "responses": ["While immersing in each stage can be a little different, for the most part it's somewhat the same as well. Just consume content with intent to understand it, even if you are failing at that intent for a long time. These links and additional questions can help provide some more guidance."],
          "Field-1": ["Why we immerse from day 1", "Video I made to clear up some immersion confusion", "https://youtu.be/m0GfLNQeRvI?t=192"],
          "Field-2": ["What do we do during immersion", "A video attempting to explain what exactly we do during immersion", "https://youtu.be/m0GfLNQeRvI?t=705"],
          "Field-3": ["Active Immersion Stage 1", "Refold article on Active immersion", "https://refold.la/roadmap/stage-1/a/active-immersion"],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"What do I do during immersion?  /  When should I start immersing?",
          "context_set": ""
         },
         {"tag": "Immersion-BackIntoImmersing",
          "patterns": ["How to get back into immersing", "how do I get back into immersing after a long break"],
          "responses": ["Just do it. Don't be afraid to start small and work your way back up slowly to a more respectable immersion schedule. Even if you immerse 5 min a day and gradually increase that daily goal over time, as long as you work towards that recommended 2+ hour minimum, it is progress."],
          "Field-1": ["", "", ""],
          "Field-2": ["", "", ""],
          "Field-3": ["", "", ""],
          "Field-4": ["", "", ""],
          "Field-5": ["", "", ""],
          "Field-6": ["", "", ""],
          "Related-Q":"",
          "context_set": ""
         },