{"tag": "Misc-ThatNotAQuestion",
   "patterns": ["Input", "output", "anki", "refold", "immersion", "AJATT", "sentence mining", "Pronunciation", "books", "reading", "cards", "decks", "Novels"],
   "responses": ["Sorry but that's not a question. Please try asking me a question :)"],
   "Field-1": ["", "", ""],
   "Field-2": ["", "", ""],
   "Field-3": ["", "", ""],
   "Field-4": ["", "", ""],
   "Field-5": ["", "", ""],
   "Field-6": ["", "", ""],
   "Related-Q":"",
   "context_set": ""
  },
   {"tag": "misc-ShouldLearnPitch",
    "patterns": ["Should I learn Pitch Accent", "How do I learn pitch accent", "When do i learn pitch accent", "pitch accent"],
    "responses": ["This is a complicated question that depends on a lot of things. But here is the basic answer.\n\n **Stage 1 - basic**\n I recommend just becoming familiar with pitch accent. Understand it as a concept and know what it is to be aware of it as you immerse. This alone will be incredibly valuable even if you don't go any further with it. Such a small investment can really add up over time, so we recommend doing at least this.\n\n **Stage 1 - A little more**\nIf you arent feeling overwhelmed, and want to take it a bit further, then I recommend learning the pitch patterns and training your ear to hear them in words. Linked below are resources for learning basics about pitch accent and a website to help do maybe 5-10 min a day of basic pitch listening practice.\n\n **Stage-2 - If you dare**\n Once you are in stage 2, you can take it a bit further by starting to learn the pitch for the words you are learning in Anki. The most consuming part about learning pitch accent is learning the pitch of the individual words, so starting to test the pitch of a word in the SRS is something you can start in stage 2. Don't worry about adding this extra level of difficulty earlier. The words you learned up till now are so common they should be easy to fill in later. \n\n **Stage 3 - Ready to Output**\n In stage 3, once you are ready to start outputting, you can get more serious about pitch. Head on over to <#781673820544172034> and ask how to level up your pitch accent when starting to output."],
    "Field-1": ["Dogen Pitch Intro 1", "Dogen, a known pitch enthusiast in Japanese goes over the basics of pitch-accent", "https://www.youtube.com/watch?v=jakXVEUTT48"],
    "Field-2": ["Dogen Pitch Intro 2", "Dogen, a known pitch enthusiast in Japanese goes over the basics of pitch-accent", "https://www.youtube.com/watch?v=I_s6QqmJd7k"],
    "Field-3": ["MattVsJapan Word-Pitch", "Matt, co-creator of Refold, goes over word level pitch accent info", "https://youtu.be/hWHvLvLs2KQ"],
    "Field-4": ["Word Pitch Training", "This website will help you train your ear to hear word level pitch accent. A good basic trainer", "https://kotu.io/tests/pitchAccent/minimalPairs"],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"What is Pitch Accent?",
    "context_set": ""
   },
   {"tag": "Misc-WhatIsPitchAccent",
      "patterns": ["what is pitch", "what is pitch accent", "what is pitch-accent", "What is accent"],
      "responses": ["It's hard to explain, but it's definitely a challenging aspect of sounding native in Japanese. I've linked some beginner resources for you down below to learn the basics."],
      "Field-1": ["Dogen Pitch Intro 1", "Dogen, a known pitch enthusiast in Japanese goes over the basics of pitch-accent", "https://www.youtube.com/watch?v=jakXVEUTT48"],
      "Field-2": ["Dogen Pitch Intro 2", "Dogen, a known pitch enthusiast in Japanese goes over the basics of pitch-accent", "https://www.youtube.com/watch?v=I_s6QqmJd7k"],
      "Field-3": ["MattVsJapan Word-Pitch", "Matt, co-creator of Refold, goes over word level pitch accent info", "https://youtu.be/hWHvLvLs2KQ"],
      "Field-4": ["Word Pitch Training", "This website will help you train your ear to hear word level pitch accent. A good basic trainer", "https://kotu.io/tests/pitchAccent/minimalPairs"],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"Should I learn Pitch Accent?",
      "context_set": ""
     },
   {"tag": "Misc-WhatDoesXMeanHowdoYouSay",
      "patterns": ["how do I say in japanese", "what does mean in Japanese", "What does おはよう mean", "what does mean"],
      "responses": ["I'm not 100% sure, but I think this question falls under FAQ#1. I have linked it below. Please go check out the answer there and see if it covers what you asked. If it does not, I apologize. Please come back and try asking another way."],
      "Field-1": ["FAQ #1", "An important rule, although frustrating at first.", "https://discord.com/channels/778787713012727809/788475930670530571/788515203901292545"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-HowLongDoesItTake",
      "patterns": ["How long does it take to start understanding anime", "how long does it take to learn Japanese", "how long does it take to be fluent", "how long does Refold take", "how long does learning Japanese take", "how long before I can understand Youtube", "how long before I can understand slice of life", "how long before I can understand", "how long does it take", "What is my expected time to learn japanese", "When will I be able to start speaking Japanese", "When can I start speaking", "when will i be fluent", "how long till i'm fluent", "how long does it take to get fluent"],
      "responses": ["It is complicated to answer how long it takes before you understand the language or become fluent. It depends on so many things. How much you immerse, your natural ability, how much time you invest, how focused and how quality the time you spend is, and more. For things like slice-of-life anime, if you immerse a lot in it, it will be quite manageable for you long before fast-paced, mumbled YouTube videos or complex comedy skits. \n\nMy advice is this. Don't focus on how long it will take. Instead, focus on investing time per day. Make that time quality. Stick to it and enjoy your immersion. No matter who you are, it will take a long time to reach a high level in your language. And no amount of worrying about it will make it go faster. So let go of expectations and requirements, investing the time, enjoying that time, making that time focused quality time, and let the progress unfold as it does. The only thing I can promise is, immersion learning is the best way to reach a high, natural level in the language.\n\nFor some rough benchmarks, ask me the related question below so you can figure out a very rough benchmark on time to progress relation."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How much should I be immersing per day?",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsKeigo",
      "patterns": ["what is keigo"],
      "responses": ["Keigo is the name for incredibly polite speech in Japanese. Until you are fluent, I wouldn't worry about precisely what Keigo is and instead focus on understanding your immersion. Over time you will gain instincts for what is polite and what is not. Once you are functionally fluent in Japanese, if there are still details of politeness levels that you don't understand, you can ask a Native Japanese speaker IN Japanese. But until then, focus on grasping the low-hanging fruit."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-ShouldITakeJapaneseClass",
      "patterns": ["Should I take a college class to learn japanese", "should I take a Japanese class", "should I take a Japanese course at school", "are japanese classes worth it"],
      "responses": ["This is really up to you. What I can say is, most Japanese classes teach skill-based language learning rather than going with an immersion style language learning method. This generally leads to more unnatural Japanese ability and requires you to pass tests and do grammar drills. All things we feel are useless and even detrimental to the language learning process. However, if you NEED to take a Japanese class, we recommend that you immerse as much as you can in your free time to help counter act some of the negative effects this \"skill based language learning\" can have."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsMoreImportantMemoryOfImmersion",
      "patterns": ["What is more important memory or immersion", "What's more important, memory or immersion", "Memory vs. Immersion"],
      "responses": ["I don't qutie 100% understand this question. Immerison and memory arent relateable things. It helps to have a good memory, but even if you have a bad memory, you can learn a language and immersion will help you acomplish it."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-FAQ1",
      "patterns": ["what is FAQ1", "What is FAQ#1", "What is FAQ 1"],
      "responses": ["As a general rule, we try not to answer most questions like \"what does X mean\", \"What is the difference between A and B\" and other variations on this in the discord. Many of us truly believe that the \"accept the ambiguity\" advice of the Refold website is really important. We highly recommend you do your best to constantly hunt for low-hanging fruit. Sentences that with minimal effort (a quick dictionary search) you can understand easily. The faster you can train your brain to let go of things out of your reach and keep hunting for this low hanging fruit, the quicker you will make progress. Don't obsess over why something is the way it is; just accept it and continue trying to figure it out over time as you get more examples through additional input.\n\nIt's great that you have questions. But discord/other learners is not where you find answers to those questions. Immersion is where you will find answers to those questions. It's a mindset that will pay dividends as you continue on your journey. Once you brain is primed with a question, it will hunt for the answer in immersion and result in an instinct for the language that no grammar guide, no language learner, and often even, no native Japanese speaker could ever properly explain to you. So, you'll see this a lot, \"the answer is immersion\". \"Acquire\" the language, don't \"learn\" it.\n\nNote: This applies to any questions about language function. \"How are A and B different? How are A and B the same? Why is A this way. Why isn't B this way.\" Whatever modification to the same exact idea you can think of, the answer is the same. \"Immerse more\".\n\nThis is not because we don't want to answer your question. This is because, it's better for YOU that we don't. Happy immersing 🙂"],
      "Field-1": ["Refold Tolerate the Ambiguity", "A critical concept to understand.", "https://refold.la/roadmap/stage-0/b/tolerate-ambiguity"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-HowDoITypeInJapanese",
      "patterns": ["How do I type in Japanese", "how do use a japanese keyboard", "how do I install japanese IME", "how do i type in Japanese on"],
      "responses": ["I've linked some resources below. You can also try asking YouTube if video works better for you."],
      "Field-1": ["iOS and Androidi", "Type in Japanese.", "https://kawakawalearningstudio.com/study/japanese/type-japanese-phone-iphone-android/"],
      "Field-2": ["Windows", "Type in Japanese", "https://techwelkin.com/how-to-install-and-use-google-ime#:~:text=Go%20to%20Control%20Panel%20%2D%3E%20Language,Select%20Google%20IME"],
      "Field-3": ["Mac", "Type in Japanese", "https://support.apple.com/guide/japanese-input-method/set-up-the-input-source-jpim10267/mac"],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-HowDoIGetAudioOnMyPhone",
      "patterns": ["How do I get audio on my phone", "how to I get passive audio on my phone"],
      "responses": ["There are too many types of phones and devices to keep up on, I'm sorry, but I will have to leave it to you to figure out how to transfer audio to your phone. Try googling this or searching YouTube. However, if you wonder how to get audio to put on your phone, try asking me a related question. I've linked some below."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What is good way to passive immerse",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsFluency",
      "patterns": ["What is fluency"],
      "responses": ["Fluency is a tricky thing to define. I kind of see it as your ability to function in the majority of life's situations in a language without language being any type of barrier. In the end, though, how you define it is not important. You know your goals, so go achieve them and stop worrying about little details like this. Go immerse! Good luck :D"],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhatDictioanryToUse",
      "patterns": ["What dictionary should I use", "what are some good dictionary", "bilingual dictionaries", "monolingual dictionaries", "Where to get yomichan dictionaries", "where to get migaku dictionaries", "where do I get yomichan dictioanries", "where do I get migaku dictionaries", "where do I get dictionaries"],
      "responses": ["It depends on what kind of dictionary you want. I've linked a video with some bilingual as well as monolingual dictionaries compatible with Yomichan/Migaku. I've also attached a popular browser dictionary. Searching for a Japanese dictionary in whatever app store you use should bring up options as far as phone dictionaries go. Almost any dictionary should work. So maybe download a few and see which one you like best."],
      "Field-1": ["Yomichan/Migaku dictionaries", "MattVsJapan video going over and linking too many dictionaries.", "https://www.youtube.com/watch?v=5oxdPY9eH48"],
      "Field-2": ["Jisho.org", "A very popular browser dictionary", "https://jisho.org/"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-HowDoILookUpSpecificWords",
      "patterns": ["how do I look up specific words", "how do I look words up"],
      "responses": ["By the time you are done with your foundation deck, you should know enough vocabulary and have enough of a grammar foundation that parsing sentences are quite manageable. To continue working through your foundation deck and browsing a basic grammar guide every day and this ability should come naturally."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How should I learn vocabulary? /  How should I learn grammar?",
      "context_set": ""
     },
     {"tag": "Misc-HowDoIWriteMyNameInJapanese",
      "patterns": ["How do I write my name in japanese"],
      "responses": ["I can't help you with this. What I can say is, I think you should not worry about this and instead focus on understanding your immersion. The first step, above all else, is slowly chipping away at the language to understand it. Don't worry about writing, speaking, etc., until you have high comprehension first. The goals of stages 1 and 2 of Refold are understanding the language. Then, in stage 3, we can worry about speaking and writing."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-HowCanISoundNativeInJapanese",
      "patterns": ["How can I sound native", "how do I sound native"],
      "responses": ["This is a very challenging, long road if this is your goal. While obtaining a native level is a goal most will not achieve, I can say that if you follow the Refold method, you will get as close as you are capable of achieving. Focus on comprehension, train your ear to hear the language like a native, and then you will have the tools to train your mouth to mimic it. Ear first, mouth follows. Good luck!"],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhenSwitchPhoneComputerToJapanese",
      "patterns": ["When should I change phone to Japanese", "when do I change computer to Japanese", "how to change phonet to Japanese", "how do change computer to Japanese", "should i change my laptop language to japanese", "should i change my computer to japanese"],
      "responses": ["While some advocate doing this from day one, we recommend waiting till you are motivated too. There isn't a huge benefit to changing your phone to Japanese. It often creates more headache than it's worth and can work towards burning you out. But if you are super hyped to do so, then do so. Otherwise, wait till you have enough of a foundation that it isn't an undesirable process. Don't force it. Instead, focus on getting more quality immersion."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsInput",
      "patterns": ["what is input"],
      "responses": ["Input is consuming Japanese content. Books, anime, movies, YouTube. Anything made for natives by natives is what we refer to when we say Input in the context of Refold."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsOutput",
      "patterns": ["what is output"],
      "responses": ["By output, we mean speaking and writing. Anything that goes from your brain out to the world is output."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsAJATT",
      "patterns": ["What is Ajatt", "What's AJATT"],
      "responses": ["AJATT is **All Japanese All The Time**. This is an old input-based immersion method that was the beginning of immersion becoming popular inside the Japanese Language learning community. The creator of Refold came from AJATT and designed Refold to be a better, more streamlined, efficient and comprehensive method for learning Japanese. Refold takes the core concepts of AJATT and updates all of the details to be better."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsSliceOfLife",
      "patterns": ["What is slice of life", "What is SoL"],
      "responses": ["Slice of Life is a genre of content. It basically means people going about their everyday lives. It's often considered the best domain to master first because it uses everyday vocabulary much more than a show about hunting demons would."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhoIsStevenKrashen",
      "patterns": ["Steven Krashen", "Who is Steven Krashen", "who is Dr. Steven Krashen", "Stephen Krashen", "who is Stephen Krashen", "who is Dr Stephen Krashen"],
      "responses": ["Dr. Stephen Krashen is a champion of input-based language learning methods and creator of **The Input Hypothesis**. He is the most prominent early champion of the foundations we still work off today and has proved its effectiveness."],
      "Field-1": ["Dr.Stephen Krashen and MattVsJapan", "Matt interviews Dr. Krashen and provides a fantastic introduction to immersion learning in the process.", "https://www.youtube.com/watch?v=_VYfpL6lcjE"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-AmITooOldToLearnALanguage",
      "patterns": ["Am I too old to learn another language"],
      "responses": ["No. Actually, our adult analytical minds provide tools for learning languages we did not have as babies that makes the process go much further. We don't have to immerse 16 waking hours for 10 years to speak like a 10-year-old does. However, the older you are, the harder it will be to obtain a perfect native-level accent and pronunciation, while very young people can still have an easier time with that aspect of language learning."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsFastestWay",
      "patterns": ["Fastest way to learn Japanese", "what is the fastest way to learn Japanese", "what is the fastest method to learn a language", "how to learn fastest"],
      "responses": ["Refold is designed to be the most effective method and will continue to evolve until it is. But, in the end, you need to be honest with yourself. Japanese is a challenging language for people with no similar languages (like Korean) under their belt. It will take a significant investment to reach high levels in the language. I suggest not worrying about how long it will take. Instead, invest an appropriate amount of time every day and enjoy the process. The related question below should provide some more info."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How much should I immerse everyday?",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsComprehension",
      "patterns": ["what is comprehension"],
      "responses": ["Comprehension is understanding the content you are immersing in."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What are comcprehension levels?",
      "context_set": ""
     },
     {"tag": "Misc-WhatIsPhonology",
      "patterns": ["What is phonology"],
      "responses": ["The system of contrastive relationships among the speech sounds that constitute the fundamental components of a language. Basically, how the language sounds. But I recommend not worrying about it too much till phase 3. Instead, focus on training your ear to hear the sounds through exposure to the language. Focused exposure with intent to understand. Then in stage 3, you can worry more about pronunciation and phonology. Once your ear is properly trained to actually hear the language, you will be equipped to then mimic it."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-WhenShouldIStudy",
      "patterns": ["When should I study", "when should I do anki", "should I do anki in the morning", "should I do anki in the morning or at night", "when should I immerse"],
      "responses": ["It's personal preference when you immerse or do Anki. Decide what time of day is best for you and in what order you want to do them."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"When should I start immersing?",
      "context_set": ""
     },
     {"tag": "Misc-ShouldIListenTOJapaneseWhileISleep",
      "patterns": ["Should I listen to Japanese as I sleep", "should I immerse while sleeping"],
      "responses": ["Some people claim this is the **hardcore way to do it**. I personally think it's pointless. I believe you will benefit much more from a good, uninterrupted night's sleep than by getting sleeping exposure to the language. This is, of course, up to you, but I highly recommend against it."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-ShouldIDoAJATT",
      "patterns": ["Should I follow AJATT", "Should I do AJATT"],
      "responses": ["Refold is designed to be the most effective and efficient language learning method in the world. While it's roots come from AJATT, we believe that AJATT is an old, out-of-date, and antiquated language learning method. Many aspects of AJATT are inefficient or unnecessary. You, of course, can read up on AJATT if you want and take whatever lessons you want from that, but in the end, it's not as good as what we are developing here."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-IsJapaneseHard",
      "patterns": ["Is Japanese hard", "is Japanese a hard language to learn"],
      "responses": ["If you have no experience in other, somewhat related languages (such as Korean), then yes. It can be a challenging language, and you should be prepared for a Marathon. Learn patience and consistency, and you will be fluent. But be impatient and inconsistent, and it will be hard to reach your goals."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How much should I immerse everyday?",
      "context_set": ""
     },
     {"tag": "Misc-BetterAtTranslating",
      "patterns": ["How do I get better at translating"],
      "responses": ["I don't know. Probably by translating things and getting someone to look over y our translations and critique them. Refold is not bout translating. It's about building instincts in the language, so you process Japanese as base meaning and avoid translating all together. Once your instincts are high enough, translating should be a pretty easy skill to develop."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-TwoLangaugesAtSameTime",
      "patterns": ["can I learn two languages at the same time", "can i learn 2 languages at once", "is it okay to learn two languages at once", "can I learn two langauges at the same time", "is it okay to learn two languages at the same time", "learning two languange", "Should I learn more than one language", "Should I learn 2 languages"],
      "responses": ["Matt has a video on this topic that I can link you too below."],
      "Field-1": ["Fastest way to learn two  languages", "MattVsJapan goes over his thoughts on this.", "https://www.youtube.com/watch?v=PlteftANWoE"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-CanspeakEngliishDuriing",
      "patterns": ["Can I speak English while learning Japanese", "can I watch english movies while learning", "can I still watch stuff in english", "can I still watch content in english", "can i still watch anime with english subtitle as hobby", "do I have to stop consuming content in my native language", "Do I have to stop watching things in english", "do I have to stop watching content in my native language"],
      "responses": ["Watching native language content and speaking your native language while learning a second language is fine for most people. It's unrealistic to expect you to cut out your native language from life 100%. The point is to try and continue finding ways to add more Japanese language exposure without negatively impacting things that are more important (such as health, relationships, job, school, etc.). So don't feel guilty about enjoying a movie in English every now and then. Just try your best to get as much exposure as you can. (It won't cause damage per say, but just removes time you could be spending with your Target Language. This time adds up in the long run, so you want to try ur best to remove it as much as you can and replace it with time in your Target Language. But we are all human, so be kind to yourself.)"],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"Can I watch with Subtitles?",
      "context_set": ""
     },
     {"tag": "Misc-WhatContentIsFree",
      "patterns": ["what materials are available for no money", "what materials are free", "how can I learn for free", "what resources are free"],
      "responses": ["The entire Refold Method and most of the resources are free. You don't need any money to learn a language, but it can help make it more convenient if you invest a little money. Netflix is an example of a service that many find very worth the small monetary investment. The Refold JP1K deck also is an example of premium content that many seem to find worth investing in. But, if you want to learn a language for $0, that is 100% possible. Read the Refold website, read the free guides, watch the free videos, check out the community document with all kinds of resources available (mostly free), and more. You will have a more challenging time finding paid content than free content, so just browse around. A great place to start is <#784120941650509865>. I've also linked some things below."],
      "Field-1": ["Refold Japanese community document", "Resources and content for all stages.", "https://refold.link/japanese"],
      "Field-2": ["Refold Website", "The whole method laid out step by step, for free.", "https://www.Refold.la"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What is JP1K?",
      "context_set": ""
     },
     {"tag": "Misc-WhereCommunityDocument",
      "patterns": ["where's the community document", "where is the community document", "community document", "community doc"],
      "responses": ["You can find the Refold Japanese Community document linked at the top of <#895084755291357194> in the \"Info and Resources\" section at the top. You can also unlock content sharing channels as well as the Community document in <#783082970432536608>"],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Misc-FrequencyLists",
      "patterns": ["What is a frequency list", "what are frequency lists", "where can I find a frequency list", "where to download frequency list", "frequency lists", "whats a good frequency list"],
      "responses": ["Frequency lists are taking a chunk of content and using a computer program to analyze it and try and figure out how frequently specific words are. You can then use these frequency lists to guess how useful a word is. While we recommend against using frequency lists as your only determining factor for adding new words, it can be very useful, especially early on, for helping inform your choices. These lists can be used with addons like Yomichan to make it easy when immersing to make informed choices."],
      "Field-1": ["Japanese Document:Frequency Lists", "Direct link to frequency lists inside the Refold document.", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.ymsyus6srh4v"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What words do I add?",
      "context_set": ""
     },
     {"tag": "Misc-HowToMakeYouTubeAccount",
      "patterns": ["how to create a separate YouTube account for immersion", "how to get Japanese content on youtube", "how to create immersion YouTube account", "How to get a Japanese youtube account"],
      "responses": ["Creating a separate account for immersion in your target language only on YouTube can be very, very powerful. Here is a video to help you navigate how to do that."],
      "Field-1": ["How To: YouTube Immersion Accounts", "Learn to create YouTube account for immersion.", "https://www.youtube.com/watch?v=-zf5DGuD-XA"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },