        {"tag": "Refold-WhatIsRefold",
         "patterns": ["What is refold", "what is immersion learning", "why should I use refold"],
         "responses": ["Refold is creating the most efficient and comprehensive immersion learning method. The video linked below should help you understand the basics of what Refold is and what we are building out here. Scroll down the page to the \"What is Refold\" section."],
         "Field-1": ["What is Refold", "Scroll down to the What is Refold video", "https://refold.la/"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do I get started?",
         "context_set": ""
        },
        {"tag": "Refold-WhatAreDomains",
         "patterns": ["What are domains", "What is a domain"],
         "responses": ["Domains are a way to make the language more manageable by breaking it up into smaller pieces to tackle one at a time. The article below should provide all the information you need to know.\n\nRemember, enjoying your immersion is more important than strictly sticking to a single domain. Also, we generally don't recommend worrying about domains till Stage 2C."],
         "Field-1": ["Refold Domains", "article on the Refold website covering domains", "https://refold.la/roadmap/stage-2/a/domains"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowNarrowAreDomainsSameGenre",
                "patterns": ["Should domains for starting active immersion be kept within the same genre", "When should I start worrying about domains", "when should I focus on a domain", "What are examples of domains", "Should I only focus on a single genre", "is X concidered a domain"],
                "responses": ["Until stage 2, we recommend not worrying about domains but just follow whatever interests you most. If you ever get sick of a domain, feel free to stray or widen the domain.\n\nDomains are not hard-coded things, but just a concept we created to help section of the language. Anything could be a domain. Anime would be a very wide domain. Drama, horror, fantasy could all be domains but also somewhat broad. Slice of life is a common first domain as it generally deals with the common language used in everyday speech. High school stories with girl protagonists that take place in Tokyo would be a somewhat small domain. The more narrow your domain, the faster you will feel comfortable in it, and the quicker you will reach that level 4 level 5 comprehension ideal for immersion. But also, the more potential there is for becoming sick of the content. So really balancing this is up to you. How small can you make a domain to make good progress, compared to how motivated can you stay.\n\nAs always, remember to prioritize motivation and interest. You will still make progress even if you never stick to a domain. It will just be slower. But slower, enjoyable progress is always better than quicker agonizing progress. And in reality, the fact that you don't enjoy the content anymore will most likely make the more efficient path actually take longer and become less efficient, so don't force a domain too much."],
                "Field-1": ["", "", ""],
                "Field-2": ["", "", ""],
                "Field-3": ["", "", ""],
                "Field-4": ["", "", ""],
                "Field-5": ["", "", ""],
                "Field-6": ["", "", ""],
                "Related-Q":"",
                "context_set": ""
               },
        {"tag": "Refold-ComprehensionLevels",
         "patterns": ["What is comprehension level 1", "What is comprehension level 2", "What is comprehension level 3", "What is comprehension level 4", "What is comprehension level 5", "What is comprehension level 6", "What are comp level", "What are comprehension levels", "What is comp 1", "what is compe 2", "what is compe 3", "what is compe 4", "what is compe 5", "what is compe 6", "Comprehensibility levels", "Immersion Comprehensibility factors"],
         "responses": ["Comprehension levels are a device Refold created to communicate how well we are comprehending our content. The stages in Refold are generally all based on comprehension, as we feel it's the most crucial part of language learning. With understanding, speaking and output follow naturally. The articles linked below go into more detail about comprehension levels."],
         "Field-1": ["Comp Levels", "This goes over the level system.", "https://refold.la/roadmap/stage-2/a/levels-of-comprehension"],
         "Field-2": ["Stage 2 Articles", "Other articles touching on comprehension factors that are worth checking out.", "https://refold.la/roadmap/stage-2/overview"],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowKnowWhatStageYouAreIn",
         "patterns": ["What stage am I in", "how do I know when to move on to next stage", "Am I ready to move onto next stage", "how do I know when i'm ready to move", "when should I start with stage 1", "When to I move to stage 1", "when do I know if i've reached stage 1", "How do I know if i've reached stage 1", "when do I go to stage 1", "when to I graduate to stage 1", "How do I know if i'm ready for stage 1", "Howw do I know when to move to stage 1", "How do I know when to graduate to stage 1", "when should I start with stage 2", "When to I move to stage 2", "when do I go to stage 2", "when to I graduate to stage 2", "when do I know if i've reached stage 2", "How do I know if i've reached stage 2", "How do I know if i'm ready for stage 2", "Howw do I know when to move to stage 2", "How do I know when to graduate to stage 2", "when should i start with stage 3", "when do I know if i've reached stage 3", "How do I know if i've reached stage 3","When to I move to stage 3", "when do I go to stage 3", "when to I graduate to stage 3", "How do I know if i'm ready for stage 3", "Howw do I know when to move to stage 3", "How do I know when to graduate to stage 3", "what stage am I at", "how do I progress to stage", "Refold step", "Refold stage", "what was the level up criteria from", "How do I level up"],
         "responses": ["Each stage has it listed somewhere in the Refold articles exactly what the criteria is to move on to the next level. For stage 1 and 3 it's at the bottom of the **Stage 1 Overview / Stage 3 Overview** article in the roadmap. In all of stage 2 these **Level Up** criteria are at the bottom of the **Immersion Guide** articles in the roadmap."],
         "Field-1": ["Refold Roadmap", "The roadmap provides all the articles you need to understand the Refold Method", "https://refold.la/roadmap"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-WhyIsEnjoyingTheLanguuageImportant",
         "patterns": ["Why is enjoying the language important", "is enjoyment important", "Why is there emphasis on enjoyment"],
         "responses": ["This is twofold. First, learning Japanese is a very long process. It will take years before you are ready to start speaking even. The more you enjoy your immersion and time with the language, the more likely you will stick with this very long process. On top of that, language acquisition benefits from focus and engagement. So being into the story, being into your immersion, enjoying your time will actually help speed up the process, and you will be able to remain more focused for longer. Your brain will pin importance on what it's watching and go to work in the background."],
         "Field-1": ["Enjoyment", "Refold enjoyment article", "https://refold.la/roadmap/stage-0/b/enjoyment"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-WhatAndWhyIsTolerateAmbiguity",
         "patterns": ["What does it mean to Tolerate Ambiguity", "why is tolerating ambiguity so important", "why do you put such importance on tolerating ambiguity"],
         "responses": ["Tolerating ambiguity is the acceptance that you won't understand everything. And not only that, but early on, you won't understand A LOT. You must be okay with this. Refold works on finding low-hanging fruit. Hunting down elements of the language that are within your grasp to obtain and understand. To do this, you have to sift through a lot of stuff that is NOT within your range. If you waste time trying to grasp these concepts and understand everything, you will drastically slow down your progress. By accepting ambiguity and being okay with not understanding, you maximize your gains in the language. I've linked an article and a video down below that further explains the importance of accepting ambiguity. This is a crucial concept to understand. I recommend going through both these resources."],
         "Field-1": ["Tolerate Ambiguity", "Refold article on tolerating ambiguity.", "https://refold.la/roadmap/stage-0/b/tolerate-ambiguity"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-WhatIsTheMonolingualTransitiion",
         "patterns": ["What is the Monolingual Transition"],
         "responses": ["This is the act of transitioning from using the bilingual dictionary to using a monolingual dictionary. I recommend checking out the resources I've linked below for more info."],
         "Field-1": ["Caasual Monolingual Transition", "Article on casual transition.", "https://refold.la/roadmap/stage-2/b/casual-monolingual-transition"],
         "Field-2": ["Structured Monolingual Transition", "Article on structured monolingual transition.", "https://refold.la/roadmap/stage-2/c/structured-monolingual-transition"],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-WhenShouldIMonolingualTransition",
         "patterns": ["When should I do the Monolingual Transition", "when is it recomended to do the monolingual transition", "when monolingual transition"],
         "responses": ["This is up to you. Refold recommends doing it in stage 2B or 2C. However, you can do it earlier or later. The earlier you do it, the sooner you reap the positive benefits, but the more frustrating it will be. And it CAN be frustrating, that is for sure. The longer you wait, the easier it will be, but you will benefit from its benefits later. In the end, as soon as you are motivated and excited to make the transition, go for it. Even if you start and get sick of it, you can take a break and postpone the rest for later."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowLongTillStageX",
         "patterns": ["How long till I reach stage", "how long till stage", "how long to reach stage", "how long does it take to reach stage", "when will i reach stage"],
         "responses": ["Sorry but this isn't a question I can answer. It changes from person to person so much based on so many factors that it's hard to say."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowManyStagesWhatAreStages",
         "patterns": ["How many stages does the method have", "how many stages of refold are there", "What are stages", "how many stages are there"],
         "responses": ["Refold has 4 stages, with the 4th stage being ongoing."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-WhatIsComprehensibleInput",
         "patterns": ["What is comprehensible input"],
         "responses": ["Comprehensible input is the idea that you can understand. It's capable of being understood. While finding comprehensible input that you are interested in is great, it can sometimes be challenging. We don't recommend spending more than a handful of minutes looking for your next piece of content. Hunting for content within your range can sometimes be a big waste of time. If you have some stuff you feel is in your range, go for it, but Refold focuses on finding little chunks of comprehensible input. Sentences here and there. Words here and there. Focus more on finding the content you are interested in and engaged by more so than content in your range. For some people, that interest comes from being comprehensible. For others, it comes from following a subject. Whatever works for you, try and follow it, but don't procrastinate too much by overhunting that perfect piece of content. Volume is essential with immersion. We want A LOT of it."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-IsOnlyForJapanese",
         "patterns": ["is refold only for japanese"],
         "responses": ["No, Refold can be used for any language where native content is obtainable."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowOldIsRefold",
         "patterns": ["how long has refold been around for", "how old is refold", "When was Refold founded"],
         "responses": ["I'll have to get back to you on this. But here is some info on Refold"],
         "Field-1": ["About Refold", "Refold about page", "https://refold.la/about"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowDoWeKnowRefoldImmersionWorks",
         "patterns": ["proof refold works", "how do i know refold works", "does refold actually work", "evidence for refold", "immersion science", "refold science", "does immersion actually work", "evidence for immersion", "how do I know immersion works", "how do we know immersion works", "what is the proof refold works"],
         "responses": ["The core, the foundation of Refold, is immersion learning. Thousands of people and tons of data are proof that immersion learning works. Dr. Stephen Krashen has spent his life promoting the Input Hypothesis. The foundation for all immersion learning methods. While Refold searches to find the best way to apply these language acquisition principles in an easy-to-follow, step by steep process, in the end, it all comes down to immersion. Matt, the creator of Refold, has used immersion to reach incredibly high levels in Japanese, along with thousands of others. If Immersion works is not the question. The question is, how much more can we streamline the process."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowManyDomains",
         "patterns": ["How many domains should I know", "How many domains do I need to know", "How many domains should I master"],
         "responses": ["Life is made up of domains. You will need to know however many domains you feel you need to know to live and function in the life you want. That being said, we recommend focusing on 1 somewhat narrow domain at a time, especially early on, to help speed up your progress. Getting more exposure to similar vocab and concepts will accelerate the rate at which you acquire those ideas fully. So focusing in on a narrow domain will help that happen."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowSupportRefoldPatreon",
         "patterns": ["Where can I support refold", "how do I support Refold", "Does Refold have a Patreon", "where is the refold Patreon"],
         "responses": ["The best way to support Refold is by joining our Patreon. This gives us the resources we need to continue developing resources to make the method and process more effective. This also gets you access to various perks that are listed on the Patreon website. We really appreciate all the support we can get. Thank you!"],
         "Field-1": ["Refold Patreon", "Come support us and receive perks in the process.", "https://www.patreon.com/refold"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-WhatDomainFirst",
         "patterns": ["What domain should I try first", "what domain should I do first"],
         "responses": ["We generally recommend people do a Slice of Life domain first. Slice of life content typically has vocabulary and speech patterns that more closely resemble everyday speech, so we find it a beneficial first domain. But with that said, never force content. If it is messing with your motivation, find whatever domain works for you."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What is Slice of life?",
         "context_set": ""
        },
        {"tag": "Refold-Stage2Chell",
         "patterns": ["What is 2C", "why does 2C take so long", "how long does 2C take", "tell me about the 2c dungeon", "tell me about 2C hell", "how to pass 2C easily"],
         "responses": ["Stage 2C, other than Stage 4, which is ongoing, is generally by far the longest stage in Refold. This is where you take your comprehension in your first domain from comprehension level 3 up to comprehension 5 or 6. There is a lot of vocabulary, phrases, sentence structures, and more in between you and the end of this stage, so it takes a long time. On top of that, you are learning increasingly less common vocabulary, so you will come across each word you learn less and less often. This can make progress feel non-existent even though, in actuality, you are continuing to make significant progress. It can take years, depending on you and your time invested. Patience is the key to making it through this stage, but know you are not alone. Everyone has to trudge through this desert, and the oasis at the end will be all that more satisfying because of the challenge. Sadly there is not trick to make this stage faster other than, just immerse more."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowSmallADomain",
         "patterns": ["How small should a domain be", "how much you should shrink your domain", "how much should you shrink your domain", "how narrow should my domain be"],
         "responses": ["This is kind of up to you. The more narrow your domain, the more likely you will come across the same vocabulary and elements to fully acquire them. However, you also want to make sure you stay motivated and engaged in your immersion rather than mindlessly board with an extremely narrow domain. You will need to find this balance for yourself. In the end, as long as you are spending focused, quality time with the language, you WILL learn it. So don't stress too much about having the perfect domain size. Just have it on your mind and try your best."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-UnofficialGuide",
         "patterns": ["Unofficial guide", "where is the unofficial guidie", "Where is the unofficial Japanese Stage 1 guide", "Stage 1 unofficial guide"],
         "responses": ["You can find the Refold Unofficial Stage 1 Japanese guide, the guide that shows you exactly step by step how to take Refold and apply it to Japanese in the <#784120941650509865> channel. It's linked in the **Stage 1: Lay the foundatioin** section."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-WhatIsSnowballEffect",
         "patterns": ["what is snowball effect", "what is the snowball effect"],
         "responses": ["The **snowball effect** is basically the idea that new elements generally become easier to learn and understand as you know more and more of the language. This is because you now have solidified knowledge and memories to attach and relate new info to.\n\nI have linked a video below that covers the **snowball effect** as well as **low hanging fruit** and how this applies to leeches in Anki. While the video covers leeches, this concept applies to many elements of the Refold method and why we make the recommendations."],
         "Field-1": ["Snowball / Low hanging fruit and more", "Goes over the snowball effect, low hanging fruit and how it applies to leeches. Although it applies to many aspects of the process.", "https://www.youtube.com/watch?v=lj-fS-BKrqg&feature=youtu.be"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-Whatis1T",
         "patterns": ["What is 1T", "What is i+1", "what is a 1T sentence", "what is a i+1 sentence", "What are IT sentences", "What is an iT sentence"],
         "responses": ["1T (or i+1) sentence, is short for 1 target sentence. It is a concept you don't need to worry about till you start sentence mining in stage 2. It basically is a perfect sentence where you understand everything but 1 element. We hunt these sentences down to slowly chip away, learning new vocabulary in context that we understand once we look up that 1 new element. I've linked a refold article below talking about it, but I would not worry about it too much till you are ready to start sentence mining."],
         "Field-1": ["1T sentences", "goes over what a 1T sentence is.", "https://refold.la/roadmap/stage-2/a/basic-sentence-mining#Select-One-Target-1T-Sentences"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Refold-HowGetPeopleToJoin",
                "patterns": ["How do I get my friend to join refold", "How do I get people to join refold", "how do I convince my friend to try refold", "Who do I convince my friend to join refold", "How do I get somebody to try refold", "how do I get somebody to join refold"],
                "responses": ["The best thing you can do is share your progress and experience with them so far. If they are interested, point them to the website and tell them that it is a lot of info to take in at first, so join the Discord and ask questions. The Discord has a lot of people very willing to help you navigate the process.\n\nHowever, if that does not work, then the best thing you can do is just stay quiet about it. Reach a very high level in your language, and if you do that, people will beg you to teach them how you did it. You won't have to convince them of anything. Actions speak louder than words. Happy immersing!"],
                "Field-1": ["", "", ""],
                "Field-2": ["", "", ""],
                "Field-3": ["", "", ""],
                "Field-4": ["", "", ""],
                "Field-5": ["", "", ""],
                "Field-6": ["", "", ""],
                "Related-Q":"",
                "context_set": ""
               },