        {"tag": "SentenceMining-WhatIsSentenceMining",
         "patterns": ["What is sentence mining", "how do i start sentence mining", "sentence mining", "how to mine vocabulary", "how to mine"],
         "responses": ["Sentence mining is the recommended way of learning new vocabulary after you have finished your initial foundation vocabulary deck. I have linked two articles below that should tell you a lot more about sentence mining and its details. Once you understand what sentence mining is, you may want to ask me about tools people use to help make the process easier and more efficient."],
         "Field-1": ["Basic sentence mining", "Refold article on the basics of what mining is.", "https://refold.la/roadmap/stage-2/a/basic-sentence-mining"],
         "Field-2": ["Advanced sentence mining", "More sentence mining info", "https://refold.la/roadmap/stage-2/b/advanced-sentence-mining"],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What sentence mining tools should I use?",
         "context_set": ""
        },
        {"tag": "SentenceMining-WhatToolsToUse",
         "patterns": ["What sentence mining tools should I use", "How do I sentence mine", "sentence mining workflows", "what are recommended sentence mining programs", "what do I use for sentence mining", "do you have any immersion tools", "what tools should I use for immersing", "Which sentence mining workflow takes the least amount of time to set up", "what sentence mining tools are the best", "which sentence miining workflows are the easiest", "how to make sentence cards", "How do i make flash cards"],
         "responses": ["I can't say which is best, fastest or easiest, but there are many tools available for immersion dictionary lookups and sentence mining for all sorts of platforms nowadays. We have collected some of the tools and workflows our members use in the \"Refold Tech & Tools\" document. So, scroll down to the sentence mining section and check out the various tools and workflows available and figure out which one works best for you. I suggest you find one that works for you that is quick and easy, learn it, then don't worry about it again. Wasting too much time constantly learning new tools that do something you already know how to do just takes time away from immersion. Invest in a good workflow and use it."],
         "Field-1": ["Refold Tools document", "Document with ton's of valuable tools and resources", "https://refold.link/Tech_and_Tools"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What is sentence mining?",
         "context_set": ""
        },
        {"tag": "SentenceMining-WhatwordsToAdd",
         "patterns": ["What words should I add", "should i add every words I don't know", "how do I know what words to add when sentence mining"],
         "responses": ["What words to make cards from and add to your Anki is a skill that gets better over time. But in short, there are two things you want to keep in mind.\n\n1. How useful do you think the word is. You can use your instincts on this. Obviously, words dealing with complex surgical procedures if you aren't a surgeon or physics terminology if you don't often talk about or engage in physics content would not be that useful. But if you look at the word, figure out what it means, and feel it's a word worth knowing and could be common, then go ahead and add it. If you were wrong about its usefulness later, you can always suspend/delete the card. Or if you pass it up and feel you are wrong, you can add it later. Any word worth learning, you will come across more than once. So don't worry about missing out on a word.\n\n2. If the above criteria is met, then the next thing you want to consider is, do you feel you will remember it the next time you see it. As you get more of a foundation, you'll start to notice that some words just seem to stick. Or are similar to another word you know, and you may feel you don't need the SRS to remember it. Only add a word to the SRS if you feel you need the SRS to remember it. But if you get the feeling that you might remember it without Anki, then don't add it and instead focus on adding words you feel the benefit from adding to your flashcards."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "SentenceMining-DoesMiningCountAsImmersion",
         "patterns": ["does sentence mining count as immersion", "is sentence mining immersion"],
         "responses": ["This depends on how you are doing it. If you are using morphman to find sentences (not recommended), then no, this is not immersion. If you sentence mine how we recommend, then yes, it is immersion. Some people see sentence mining as an individual activity. In reality, sentence mining and immersion are one and the same. You don't necessarily want to go into your immersion with a focus on looking for sentences. Instead, you want to focus on understanding your immersion. During that process, you will naturally come across sentences where you think to yourself \"Oh man, I almost understood that. What prevented me from understanding it?\". In these moments, you can go back and investigate with a dictionary. If the sentence is a perfect 1T sentence, a sentence where you can fully understand it once you know that 1 unknown element, you can add it to Anki. So, in reality, sentence mining is a bi-product of immersion and trying to understand your immersion."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"Should I use morphman?",
         "context_set": ""
        },
        {"tag": "SentenceMining-WhenToStartSentenceMining",
         "patterns": ["When should I start sentence mining", "when can i sentence mine", "when I can sentence minning", "should you sentence mine straight away", "Should I finish the JP1K deck before beginning to sentence mine", "when can i start sentence mining", "Can I start sentence mining after words"],
         "responses": ["We recommend going through a premade vocabulary foundation deck, such as the Refold JP1K, before sentence mining. This foundation will make sentence mining much more accessible. However, if you are motivated to start mining early and find perfect 1T sentence cards, you are more than welcome to start whenever you want. Just be careful about taking on too much too quickly, as learning the tools for sentence mining has a bit of a learning curve."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do I sentence mine? // What tools should I use for sentence mining? // What is JP1K?",
         "context_set": ""
        },
        {"tag": "SentenceMining-ShouldISentenceOrVocabMine",
         "patterns": ["Should I mine vocabulary or sentences", "should i sentence mine or vocabulary mine", "sentence mining or vocab mining", ""],
         "responses": ["You should almost always mine sentences. Other than very conreat words like \"Red\" or \"chair\", you almost always want the context you encoutnered the word in, and even with concreat words like red, it's probably best to take the sentence anyway just to have it. With that being said, while you always want the sentence, the context, what type of card you make from the data you collect (the word, definition, audio, sentence, etc), is up to you. You can make a vocab card, a sentence card, whatever you want. See related question for more info on the type of cards you can make."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "SentenceMining-DoIHaveToSentenceMine",
         "patterns": ["Do I have to sentence mine", "can i just use premade deck", "do you need to do sentence mining", "is sentence mining nessesary", "Do I need to sentence mine", "do i need to do sentence mining"],
         "responses": ["Sentence mining is not essential. Some people don't even ever use Anki, and others will use large premade decks. However, we very much recommend against this and highly recommend sentence mining for many reasons.\n\n1. Avoiding Anki altogether will likely make the process take much longer. Anki is great at priming things in your mind so that you can acquire them faster in immersion.\n\n2. Premade decks, in our experience, are vastly inferior to sentence mining. There are many reasons for this, but here is one main reason. When you sentence mine, you are actively taking words from the content you enjoy. This will increase the likelihood that you will come across those words again sooner rather than later, which also increases the rate at which you will acquire those words. This increases the rate at which your snowball grows (see related questions) and dramatically speeds up your progress. A short investment in learning the tools to sentence mine will pay dividends in the long run and save you a lot of time compared to relying on premade decks too much. (Most also find that sentence mining helps words stick better than finding even the same word in a premade deck because you understand the full context)"],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What is the snowball effect?  /  How do I sentence mine?",
         "context_set": ""
        },

