   {"tag": "Vocabulary-HowToLearnVocabulary",
    "patterns": ["How to learn vocabulary", "how get vocabulary foundation", "how do I learn vocab", "How to get a vocab foundation"],
    "responses": ["First, check out the Refold article about vocabulary and the vocabulary section of the Japanese Stage 1 Guide (both linked below). After that, chose one of the recommended Japanese foundation decks to get a vocabulary foundation before sentence mining. So don't worry about sentence mining for now unless you have already finished your foundation deck.\n\n The current recommended foundation deck is the Refold JP1K deck. Info on this deck is linked below. However, this is for Patron supporters only, so if you need other options, make sure to check out the stage 1 guide or the resource document for alternatives.\n\n Any foundation deck works. The main point of the deck is to get you ready for sentence mining, so don't stress too much on picking a deck. Any of the ones in the documents listed below will work."],
    "Field-1": ["Refold Vocabulary Article", "This covers Refolds take on vocabluary", "https://refold.la/roadmap/stage-1/c/vocabulary"],
    "Field-2": ["Stage 1 JP Guide", "Step by step guide on Refold stage 1 specificly for Japanese.", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
    "Field-3": ["Learn about JP1K", "This article explains JP1K and where to get it", "https://refold.la/japanese/deck"],
    "Field-4": ["Japanese Resource Document", "Content and resources for every stage", "https://refold.link/japanese"],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"",
    "context_set": ""
   },
   {"tag": "Vocabulary-WhatDeckToUse",
      "patterns": ["What anki deck should I use", "What foundation deck should I use", "Is the Core 2k deck good", "should I use the core 2k deck", "should I use the Core 2k/6k/10k", "is the Core 2k/6k/10k optimised a good deck to learn the most frequent used words", "is the JP1k a good deck to learn the most frequent used words", "which deck should i use to learn vocabulary", "which vocab deck is best", "which vocabulary deck is best", "Any recommended Anki decks", "what are the recomended vocab decks", "Any recommended vocab decks", "Any recommended Anki decks", "Any recommended vocabulary decks", "Jp1k vs tango n5/n4 vs core 2.3k", "JP1K Vs Tango", "Is there Anki deck recommended", "what deck to begin with", "What are the best anki decks", "best anki decks", "Wheres the premade anki decks", "good anki decks", "anki decks"],
      "responses": ["Pretty much any foundation deck in the Refold community document is okay to use as your foundation deck. Core 2k, Tango, Visual Novel deck, Manga deck, whatever you chose to get the foundation is fine. In the end, it's all just preparation for sentence mining.\n\nIf you don't mind paying for quality and convenience, we recommend you check out the Refold JP1k deck as that is our most recommended deck. We specifically designed it to be a foundation deck with immersion learning in mind. It combines vocabulary and kanji foundation in a single deck rather than splitting them up with RRTK + foundation deck like the other decks. If you don't wish to spend money on our premium deck don't fear. The other decks will service you just fine.\n\nLinks below to the community document as well as posts explaining the Refold JP1k deck."],
      "Field-1": ["Learn about JP1K", "This article explains JP1K and where to get it", "https://refold.la/japanese/deck"],
      "Field-2": ["Japanese Resource Document", "Content and resources for every stage", "https://docs.google.com/document/d/1CRIlBwd1qdHS501AfVFL5sQRdwSGna3ktWwkspRaJW0/edit#bookmark=id.50y6wiin7sr1"],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
   },
   {"tag": "Vocabulary-PremadeOrMakeOwnWhenSentenceMine",
      "patterns": ["make my own deck or use a pre-made", "use a pre-made or make my own", "make my own cards or use a pre-made deck", "pre-made deck or make my own", "should I start sentence mining", "when do I start sentence mining", "Can I start sentence mining", "can I start sentence mining if I'm not finished with JP1k", "can I start sentence mining if I'm not finished with Tango", "When should II start sentence mining", "can I start sentence mining in stage 1"],
      "responses": ["At Refold we recommend you start off with a pre-made foundation deck for the first 1-2k words. After that, you should begin sentence mining your own cards. We do not recommend continuing to use pre-made decks after this initial foundation. However, you can start sentence mining as early as you want. It can be challenging to find proper 1T sentences if you start too early. But if you find a great sentence that you want to mine, feel free to do so.\n\nCareful not to overwhelm yourself with all the sentence mining tools, as there is already so much to learn in the early stages. If you are overwhelmed, fall back on your pre-made deck if you have not learned at least 1k words yet. If Anki is still confusing to you, we also recommend becoming more familiar with the program before venturing out into sentence mining tools."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Vocabulary-JP1kAndRRTK",
      "patterns": ["can i uses rrtk and j1pk", "is it okay to use RRTK and JP1k", "can I use rrtk and JP1k together"],
      "responses": ["It is not recommended to do the Refold JP1k deck and RRTK together. RRTK is intended to give you a foundation in kanji. To see kanji as individual characters and not just squiggly lines and prepare you for mastering kanji through vocabulary and reading. JP1K deck, however, was designed to do this in one step. To give you foundation kanji exposure while teaching you vocabulary simultaneously, so you don't have so much front-loaded work before building out your foundation vocabulary. So doing them together would be a waste of time in our opinion."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Vocabulary-WhatIsJp1k",
      "patterns": ["What is JP1k", "what is the JP1k deck", "what is the Refold JP1k deck", "Where can I find the JP1k deck", "where can I get the Refold JP1k deck", "Where is the Jp1k anki deck", "What's JP1K"],
      "responses": ["The Refold JP1K deck is a foundation deck created by Refold. It was designed to combine Kanji foundation and vocabulary foundation in one step, thus saving learners time, rather than doing Kanji foundation through RRTK and vocabulary after that. The JP1k deck is a premium deck, so those wishing to not pay for quality and convenience have plenty of free options in the community document. You can find all the info you need on the JP1K deck in the links below."],
      "Field-1": ["Learn about JP1K", "This article explains JP1K and where to get it", "https://refold.la/japanese/deck"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What anki deck should I use?",
      "context_set": ""
     },
     {"tag": "Vocabulary-WhatIsTango",
      "patterns": ["what is tango", "what is Tango N5"],
      "responses": ["Tango used to be the recommended foundation vocabulary deck before the Refold JP1K was created. While many still use it, it is not the go-to recommended deck anymore."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What is JP1k?",
      "context_set": ""
     },
     {"tag": "Vocabulary-ShouldIUseMnemonics",
      "patterns": ["Using mnemonics to remember words", "mnemonics for vocabulary", "should I use mnemonics"],
      "responses": ["This is a personal choice, but our general recommendation is to not worry about mnemonics. The occasional mnemonic that pops into your mind naturally is fine, but wasting too much time trying to create memory tricks to force vocabulary to stick just is not worth the time. This is a strategy that works better for traditional learning, where you hhave to learn informatiion in a specific order and you are tested on it so you have to remember the info that will be on the test. But we feel this slows down your progress in immersion learning. Instead, focus on the words that stick naturally and let the ones that don't stick go for now and try again at a later date. This all plays into our stance on letting leeches leech, low hanging fruit and the snowball effect."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Vocabulary-WhatToDoAfterFoudnationDeck",
      "patterns": ["What should I do after JP1K", "What should I do after I finish JP1K", "what should I do after Tango", "what do I do after Tango", "What should I do after I finish Tango"],
      "responses": ["After you finish your foundation vocabulary deck, such as the Refold JP1K, you want to move onto sentence mining. Check related questions for more information."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What is Sentence Mining?",
      "context_set": ""
     },
     {"tag": "Vocabulary-HowDoIUpdateMyJp1KDEck",
      "patterns": ["How do I update JP1K", "Can I update JP1K version 1 to version 2", "how do I update the old JP1K deck to the v2", "how do I update the old JP1K to the new version", "how to update jpk1", "upgrade jp1k"],
      "responses": ["Some members have found a way to do this and provided step by step guidelines. I've linked you to the post that talks about it below^^. "],
      "Field-1": ["JP1K V1 to V2 update", "This FAQ post has links to help", "https://discord.com/channels/778787713012727809/807336214306750525/898780745366143026"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
     {"tag": "Vocabulary-MultipleDecks",
      "patterns": ["can i use multiple decks", "should I study more than one deck", "can I use more than one deck at the same time"],
      "responses": ["How you organize your Anki profile is up to you. You can put everything into one deck or separate them into different decks however you want. But if you ask if you should study multiple premade decks simultaneously, we don't recommend this. Instead, we recommend choosing one deck, working through about 1k of the vocabulary then moving on to sentence mining. We believe sentence mining to be much more efficient than premade decks once you have a core vocabulary foundation.\n\nThe recommended vocabulary foundation deck is the Refold JP1K deck. Also, see the related questions."],
      "Field-1": ["JP1K V1 to V2 update", "This FAQ post has links to help", "https://discord.com/channels/778787713012727809/807336214306750525/898780745366143026"],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"What Anki deck should I use?  //  What is sentence mining?",
      "context_set": ""
     },