{"tag": "KanjiAndKana-WhatIsKanjiAndKana",
    "patterns": ["What is Kanji", "What is Hiragana", "What is Katakana", "What is Kana", "Whats hiragana", "what's hiragana", "whats Kanji", "what's Kanji", "whats katakana", "what's katakana", "what is kana", "whats kana", "what's kana", "how many alphabets are there in japanese", "what are the Japanese alphabets", "how many alphabets does japanese have"],
    "responses": ["Japanese has 3 writing systems. Hiragana, Katakana and Kanji. The first two, Hiragana and Katakana (collectivly refered to often as Kana), are phonetic writing systems.\n\n**1. Kana (Hiragana and Katakana)**\n These are phonetic writing systems. This means that each character has a sound, and it's pretty simple, comparatively, to learn how to read and sound out words (much like the English alphabet). While this is not always true, for the most part, Hiragana is used to write Japanese words and form conjugations. In contrast, Katakana is usually used for loan words (words adapted from other languages).\n\n**2. Kanji**\nKanji, on the other hand, is a pictorial writing system. There are thousands of characters, and each character can have multiple meanings and multiple ways of reading them. This is why we recommend learning kanji the way we do. Even if you could import every kanji into your brain, like in The Matrix, you still would not be able to read Japanese. Without a lot of vocabulary knowledge and reading practice, you would not know which reading to use when reading words you don't know. This is because character meanings and readings change based on what word they are used in. This is why we recommend getting familiar with kanji and then actually mastering kanji through vocabulary and reading rather than boring frontloaded \" kanji learning\".\n\nHiragana: ひらがな\nKatakana: カタカナ\nKanji: 漢字"],
    "Field-1": ["", "", ""],
    "Field-2": ["", "", ""],
    "Field-3": ["", "", ""],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"How do you learn Kanji? / How do you learn Kana?",
    "context_set": ""
   },
{"tag": "KanjiAndKana-HowToLearnKana",
    "patterns": ["How do you learn Kana", "How do you learn Hiragana", "how do you learn katakana", "How do you learn Japanese alphabet", "Should I learn hiragana or katakana first", "should I learn kanji or kana first", "should i learn kana or kanji first", "should i learn katakana or hiragana first", "what writing system should I learn first", "How do I study kana", "How do I read hiragana", "how do I learn to read hiragana", "how do i read katakana", "how do I learn to read katakana", "When to learn Kana", "when to learn hiragana", "when to learn katakana"],
    "responses": ["Before worrying about Kanji, you want to focus on Hiragana first, then Katakana. We recommend getting a quick and dirty familiarity with the characters in Anki and then mastering them through reading subtitles. This allows you to gain exposure to the language while at the same time, you continue to solidify the alphabet.\n\nThis is covered in more detail in the Refold Unofficial Stage 1 Japanese Guide linked in <#784120941650509865>. That guide has complete instructions and Anki decks for you to use to get started."],
    "Field-1": ["Unofficial Japanese Stage 1 Guide", "This guide shows you how to apply Refold specifically to Japanese in stage 1", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
    "Field-2": ["", "", ""],
    "Field-3": ["", "", ""],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"What is Kanji? / How do you learn Kanji?",
    "context_set": ""
   },
{"tag": "KanjiAndKana-ShouldILearnToWriteKanji",
      "patterns": ["Should I learn to handwrite kanji", "how do I learn to write kanji", "do I need to learn to write kanji","is it okay if I write the kanji out", "should I learn to write", "should I learn to write japanese"],
      "responses": ["Refold does not recommend handwriting kanji/kana until after you are fluent. Obviously, if you have a deep drive or reason to do so, go for it. Still, we believe it is less efficient than learning to recognize and read kanji first. You can then focus on writing once your reading comprehension is relatively high.\n\nLearning to write kanji because most communication is done on computers isn't mandatory anymore and is more a personal choice, or for those that live and work in Japan.\n\nSome claim that writing the kanji helps them remember them. While this can be true, the amount of effort and time it takes to do so, we believe, vastly outweighs whatever benefit it might provide. You would get much more benefit just reading and learning more vocabulary.\n\nWith that being said, if you want to learn to handwrite kanji, try RTK (Remembering the Kanji), or just keep a handwritten daily journal and lookup stroke order on the fly to learn how to write kanji. Learning calligraphy and how to write kanji beautifully is beyond the scope of Refold. It should be straightforward to research in Japanese once you are fluent."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"",
      "context_set": ""
     },
{"tag": "KanjiAndKana-LearningTheReadingsOfKanji",
      "patterns": ["How do I learn to read kanji", "how do I learn the kanji readings", "how do I learn what sounds kanji make", "how do you learn to read kanji", "Should I learn individual kanji readings", "Is it helpful to memorize some readings for kanji", "Can I learn some readings for kanji", "How can i learn to read kanji with the RRTK"],
      "responses": ["Refold recommends against any frontloaded Kanji study where you memorize individual kanji meanings and readings out of context. Even if you could import all Kanji meaning and readings into your head, like loading a computer program, you still would not know how to read Japanese. Kanji meanings and readings change significantly based on the word they are being used in, making this out-of-context knowledge not worth the effort and frustration it takes to obtain.\n\nFor this reason, we recommend people get a quick and dirty recognition kanji foundation. After this foundation, proceed with the long journey of mastering Kanji through learning vocabulary and reading. Each time you see the Kanji used in a new word, you will further solidify how comfortable you are with the Kanji. Slowly, you will build an instinct for how a Kanji can be read or what it means. Eventually, you will notice you can often guess the reading and meaning of words you had never seen before. This will happen purely off instincts you built up through past vocabulary and reading."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How do you learn kanji?",
      "context_set": ""
     },
{"tag": "KanjiAndKana-HowToKnowWhichReadingToUse",
      "patterns": ["How do I know which reading to use", "if a word has multiple readings how do I know which to use", "if a vocab has more than one reading how do I know which one is correct", "how do I know which reading is correct", "if a word has multiple readings how do you know which is correct"],
      "responses": ["If you are asking about individual kanji then ask me \"How do I learn to read kanji\". If you are asking about vocabulary and how they can sometimes have multiple readings, then here are some of the basics.\n\nVocabulary can have numerous readings for many reasons. Sometimes one is more formal than the other. Sometimes one is more modern than the other. Sometimes it will actually change the meaning. So how can you tell the difference? There are a few ways.\n\n1. Read the definitions for the multiple readings. If the meaning changes, then figure out which meaning fits the context best.\n2. If the meanings are the same, listen to the audio to hear what the native is saying. If you are reading and no audio is available, then I recommend you move on. It's best, especially early on, to move on if you can't find the answer to your questions quickly.\n3. If you are at a high level and still can't figure out the difference, try looking for the answer to your question by googling your question IN Japanese. If you arent far enough along to do this yet, then move on and hunt for low-hanging fruit (things that are easily within your grasp). Don't waste time reaching for something you aren't ready to learn yet."],
      "Field-1": ["", "", ""],
      "Field-2": ["", "", ""],
      "Field-3": ["", "", ""],
      "Field-4": ["", "", ""],
      "Field-5": ["", "", ""],
      "Field-6": ["", "", ""],
      "Related-Q":"How do I learn to read kanji",
      "context_set": ""
     },
     {"tag": "KanjiAndKana-ShouldIRTKRRTKJP1K",
        "patterns": ["What is RTK", "What is RRTK", "should I do RTK", "Should I do RRTK", "Should I go thorugh remembering the Kanji", "Should I go through RTK", "Should i go through RRTK", "What is Lazy Kanji", "should I do lazy kanji", "What decks should I use for kanji", "Should i do JP1K or RRTK", "rtk or rrtk", "RRTK or JP1K", "RTK or JP1K", "Is RTK worth it"],
        "responses": ["**What is RTK and RRTK?**\nRTK = Remembering the Kanji. It was a book designed to teach people how to write kanji by breaking it down to it's core elements, and using those core elements as building blocks to build kanji from.\n\nRRTK = Recognition Remembering the Kanji. This is a modified version of RRTK (once called Lazy kanji in AJATT) designed to take RTK and gear it towards immersion learning and only providing just enough kanjii exposure to see the characters as individual characaters rather than squiggly lines. You then take that foundation and master kanji through learning vocabulary and actually reading.\n\n**Should you do RTK or RRTK or JP1K?**\nRTK is way to much of an investment for learning to read. It was designed for learning to write kanji. You might use it after you are fluent and looking to write kanji, but we do not reccomend using the RTK method to learn to read or early in the process.\n\nRRTK is a decent way to get a recognition kanji foundation, but is no longer recomended. The Refold JP1k deck is recomended because it gives you foundation exposure to kanji while teaching you foundation vocabulary at the same time. This saves you some time and headache. However JP1k deck is premium deck available at the link below. If you don't want to buy a premium deck then then RRTK is recomended before starting vocabulary. See all related questions below for more info."],
        "Field-1": ["Learn about JP1K", "This article explains JP1K and where to get it", "https://refold.la/japanese/deck"],
        "Field-2": ["Stage 1 JP Guide", "Step by step guide on Refold stage 1 specificly for Japanese.", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
        "Field-3": ["", "", ""],
        "Field-4": ["", "", ""],
        "Field-5": ["", "", ""],
        "Field-6": ["", "", ""],
        "Related-Q":"How do I learn kanji? / Should I write kanji? / What is JP1K? / How do I do RRTK properly?",
        "context_set": ""
       },
       {"tag": "KanjiAndKana-AreKanjiWords",
         "patterns": ["Are kanji words", "how do kanji make words"],
         "responses": ["Kanji are characters. Most alphabets are made up of a handful of characters that represent sounds to form words. Kanji, however, are pictorial characters that have meanings that combine to make more complex words. Most single kanji represent a word by itself. Still, they can also be combined with other kanji in chaotic and elegant ways to form different words. This is why kanji have many meanings and many readings. This complex system is also why we don't recommend learning kanji from its meaning and readings but instead through vocabulary."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What is Kanji? / How should I learn Kanji?",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-HowLongDoesItTaketoLearnKana",
         "patterns": ["How long does it take to learn Kana", "How long should it take to learn Kana", "how long does it take to learn hiragana", "how long should it take to learn hiragana", "How long does it take to learn katakana", "how long should it take to learn katakana", "How long does it take to learn Kanji", "how logn should it take to learn kanji"],
         "responses": ["This is really up to you and your time investment. On average,  most people should take less than a week to become familiar with Hiragana, then another week for Katakana (or even slow roll Katakana while you start on Kanji and vocabulary). A quick and dirty foundation in the Kana should take a few days or less, and then master the kana by actually reading as laid out in the Stage 1 Japanese Guide (linked below). Don't wait to MASTER the kana before moving on. Just feel comfortable with them and continue to master them as you immerse.\n\nAs far as kanji goes, you want to get a quick and dirty kanji foundation. If you do RRTK this will take a month or two. If you do JP1k, you will get this foundation along with your vocabulary. Beyond that foundation, it will take years to learn kanji, because you will master kanji through vocabulary and reading. So as your Japanese skills go up and up, so will your kanji skills."],
         "Field-1": ["Japanese stage 1 guide", "Step by step guide on how to apply Refold to Japanese specificly", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do you learn Kana? / How do you learn kanji? / What is RRTK? / What is Kana?",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-WhatAfterRRTK",
         "patterns": ["what is next after RTK", "what should I do after RTK", "what do I do after RTK", "Whats after RTK", "What is next after RRTK", "What do I do after RRTK", "What after RRTK", "what should I do after RRTK"],
         "responses": ["After RRTK, you want to start working on a foundation vocabulary deck. Core 2k, Tango N5 or other stuch decks. The Refold content and resource document have a list of various foundation vocabulary decks."],
         "Field-1": ["Refold content and resource document", "Find content and resources for all stages of the process.", "https://refold.link/japanese"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do I learn vocabulary?",
         "context_set": ""
        },
        {"tag": "KanjiandKana-WhatAreKanjiRadicals",
         "patterns": ["What are Kanji radicals", "what are kanji primitives", "What are radicals", "what are primitives"],
         "responses": ["Kanji radicals and primitives are basically the building blocks of Kanji. Smaller pieces are put together in various different orders to create new, larger kanji."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-AlphebeticalOrder",
         "patterns": ["Does japanese have alphabetical order", "Is there an alphebetical order in Japanese", "Does hiragana have alphebetical order", "does katakana have alphebetical order", "alphebetical order"],
         "responses": ["Yes, hiragana and katakana have an order, but it's not super important to know what it is in most cases."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "KanjiAndkana-ShouldIUseWaniKani",
         "patterns": ["Should I use wanikani", "is wanikani good", "is wanikani recomended", "can I use wanikani"],
         "responses": ["We do not recommend WaniKani for many reasons. One reason is, it's a paid service. Second, it teaches vocabulary along with kanji, which causes you to HAVE to learn their vocabulary in the order they tell you. WaniKani has something like 5000+ vocabulary before you are finished. We recommend moving on to sentence mining at around 1-1.5k vocabulary. In order to finish WaniKani and get the full kanji foundation it promises, you have to do up to 5 times the recommended premade deck vocabulary before sentence mining. We believe sentence mining to be vastly superior method for learning vocabulary. It's really up to you, but we see no real benefit to WaniKani as a system pertaining to an immersion-based language acquisition method.\n\nIf you are willing to pay for a kanji/vocabulary foundation, we recommend checking out the Refold JP1K deck that is specifically designed to be used along with the Refold Method."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How should I learn Kanji? / How should I learn Vocabulary?",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-OnyomiKunyomiDifference",
         "patterns": ["What are the differences between onyomi and kuyonomi", "What's the differences between onyomi and kuyonomi"],
         "responses": ["If you really want to know the answer to this, then try googling it. But my recommendation is, don't worry about it. Knowing all the readings of a Kanji is not a great method for learning Kanji. Instead, we recommend gaining a quick and dirty foundation in kanji recognition and then mastering kanji through learning vocabulary and reading."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How should I learn Kanji?",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-DoIHaveToLearnKanjiFuriganaOkay",
         "patterns": ["can i only use furigana and no kanji", "do I have to learn Kanji", "can I just use furigana", "is furigana cheating", "is it okay to use furigana", "Kanji is too hard can I use furigana", "should i use furigana"],
         "responses": ["You do not have to learn kanji. Members of the community have skipped kanji till after they were fluent, mainly focusing on reading with furigana and listening. This is not the recommended method, as we believe most would benefit from a balanced approach once they have a listening foundation. However, if you do choose to go about it in this way, it is entirely acceptable.\n\nIf you are focusing on learning to read Kanji as recomended, it's best to avoid furigana when possible, but it's not the end of the world if some content has it."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-WhatIsFurigana",
         "patterns": ["what is furigana"],
         "responses": ["Furigana is the paractice of putting hiragana/katakana over the Kanji so people who don't know how to read the kanji by itself can read. This is often used for language learners, in childrens and young adult books/manga, and also over kanji/words that are rare enough that even adults arent expected to know the reading."],
         "Field-1": ["Wikipedia Furigana", "Some more info on furigana for those interested but not nessesary to know.", "https://en.wikipedia.org/wiki/Furigana"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-WhatIsRomajiCanIUseIt",
         "patterns": ["What is romaji is romanji ok to use", "what is romaji", "can I use romaji"],
         "responses": ["Romaji is not a real Japanese writing system but instead created for language learners as a way to attempt to represent Japanese with English letters so learners don't feel the need to learn Hiragana and Katakana. I HIGHLY recommend against this urge. Learn Hiragana at the very least. You can save katakana and even Kanji for later, but I highly recommend starting off with Hiragana. Romaji does not correctly represent Japanese sounds, and relying on it will likely lead to some bad habits."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do I learn Hiragana?",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-ShouldILearnHiraganaKatakana",
         "patterns": ["should I learn hiragana", "should I learn katakana", "do I need to know hiragana", "do I need to know katakana", "is it important to learn hiragana", "is it important to learn katakana", "is hiragana important", "is learning hiragana important", "is katakana imortant", "is learning katakana important"],
         "responses": ["Yes. Above all else, Hiragana is the most useful writing system you can learn and should be learned first. Katakana, you can learn directly after or slow roll it as you move on to kanji foundation or vocabulary."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do I learn Hiragana?",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-HowManyKanjiDoINeedToKnow",
         "patterns": ["How many kanji do I need to know", "how many kanji should I know", "how many kanji do you need to know to read", "How much kanji should I study"],
         "responses": ["I don't think focusing on how many Kanji you know is important. What's important is understanding your immersion, and you do that through vocabulary. Instead, just aim to slowly master Kanji through learning vocabulary and reading. You could know every single kanji, all of their meanings and readings, and still not be able to read Japanese. This is because kanji change reading and meaning based on what vocabulary they are used in. So instead, focus on vocabulary once you have a kanji recognition foundation."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do I learn Kanji?",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-HowManyKanjiAreThere",
         "patterns": ["how many kanji are there"],
         "responses": ["A lot, this link might help answer this question, but in the end, remember, it doesn't really matter."],
         "Field-1": ["How many kanji are there?", "Japanese stack exchange answer", "https://japanese.stackexchange.com/questions/11735/how-many-kanji-characters-are-there"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-HowManyKanjiAreThere",
         "patterns": ["How do I learn to read names"],
         "responses": ["If you arent fluent, then I don't recomend worry about this too much. But basicly the answer is kind of two fold. First, some names you will be able to read just by guessing based on the kanji and reading as you become more and more comfortable with kanji through vocabulary and reading. Beyond that, you may just have to make Anki cards for common names you come across or names you want to be able to read. Names can get pretty complicated, so just take it slow and chip away at names as you come across them and feel they are important enough to learn."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "KanjiAndKana-IsRRTKNecessary",
         "patterns": ["is rrtk necessary", "Do i have to do rrtk", "is RTK necessary", "do I have to do rtk"],
         "responses": ["Not only is it not necessary, but it's not even recommended. Refold JP1K is the recommended method for getting a kanji and vocabulary foundation. However, JP1K is a premium deck (link below for info). If you don't wish to purchase a premium deck we do recommend doing a little bit of RRTK to get a quick and dirty kanji recognition foundation before starting vocabulary."],
         "Field-1": ["JP1K Deck", "Recomended method for getting vocabulary and kanji foundation in 1 convenient step/deck", "https://refold.la/japanese/deck"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"What is JP1K? / How should I learn Kanji?",
         "context_set": ""
        },
        {"tag": "Kanji-WhenDoIStopRRTK",
         "patterns": ["stop RRTK", "when should i stop doing RRTK", "Should I delete my RTK deck", "Should I delete my RRTK deck", "Stop RTK", "When should I stop RRTK", "how long do i use RRTK"],
         "responses": ["The point of RRTK (not to be confused with RTK) is to give you enough familiarity with kanji that they look like individual characters rather than squiggly lines. Its purpose is not to learn and grind all the keywords, readings, or any of that. Instead, mastering the kanji will be accomplished through learning vocabulary and reading later on. So once you have achieved this goal and can quickly tell even two similar kanji apart if they are side by side, you can move on to vocabulary. \n\nSome people chose to rep their current RRTK cards for another couple of weeks, while others just suspend or delete the whole deck right away. This is really up to you."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"",
         "context_set": ""
        },
        {"tag": "Kanji-HowToRememberKanji",
         "patterns": ["remembering kanji", "how to remember kanji", "how do I memorize kanji", "how to remember all the kanji"],
         "responses": ["Getting a feel for kanji is a long, slow trickle process. No matter how much JP1K, RRTK, RTK, whatever you do, kanji will still be a long journey that is frustrating at times. With that being said, we believe the best way is to just keep learning vocabulary and keep reading. You will forget readings, you will get kanji confused, and get frustrated over and over. This is all part of the journey. But slowly, over time, you will build an instinct for the kanji. You will slowly start to notice that even words you don't know, you will begin to understand how it's read and what it might mean just from the kanji. This is a long process, though, so be patient, and most of all, don't be hard on yourself. Struggling with kanji is something we all go through, and the more you accept it as a long journey filled with obstacles, the easier time you will have with it."],
         "Field-1": ["", "", ""],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How should I learn Kanji?",
         "context_set": ""
        },
        {"tag": "Kanji-HowEarlyLearnKanji",
         "patterns": ["how early do we learn Kanji", "when do we learn kanji", "when should I learn kanji", "how early should I learn kanji"],
         "responses": ["The entire process and order of things are covered in the Refold Japanese unofficial stage 1 Guide. I recommend checking that out as it walks you through stage 1 step by step. You can find it linked in <#784120941650509865> along with other essential resources. But I also linked it below."],
         "Field-1": ["Japanese Stage 1 Guide", "Step by step how to apply Refold to Japanese specificly", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
         "Field-2": ["", "", ""],
         "Field-3": ["", "", ""],
         "Field-4": ["", "", ""],
         "Field-5": ["", "", ""],
         "Field-6": ["", "", ""],
         "Related-Q":"How do I learn Kanji?",
         "context_set": ""
        },
{"tag": "KanjiAndKana-HowTolearnKanjiHowRead",
    "patterns": ["How do you learn Kanji?", "How can I learn Kanji?", "How do I study Kanji", "how to read", "how do I learn to read", "Should I do the JP1K or RRTK", "What is the best way to learn Kanji"],
    "responses": ["This question is covered in the \"Unofficial Refold Japanese Stage 1 guide\"(link below). But in short,  we recommend getting a quick kanji foundation and then mastering kanji through learning vocabulary and reading. You can do this in one of two recommended ways.\n\n**1. Refold JP1K Deck**\nFor those that don't mind purchasing a premium deck for quality and convenience, we recommend the Refold JP1K deck. This deck gives you a kanji foundation while learning vocabulary.  This means no wasted time as you start working on a solid foundation for immersion from day 1.\n\n**2. RRTK - Recognition Remembering The Kanji**\nThis method does not require a Patreon subscription but requires some frontloaded work before getting into the vocabulary. You can find a full explanation as well as the link to the RRTK Anki deck in the \"Unofficial Stage 1 Japanese Guide\".\n\n For more details, check out the resources linked below.\n\n Make sure to check out all resources in <#784120941650509865> if you have not already."],
    "Field-1": ["Learn about JP1K", "This article explains JP1K and where to get it", "https://refold.la/japanese/deck"],
    "Field-2": ["Stage 1 JP Guide", "Step by step guide on Refold stage 1 specificly for Japanese.", "https://docs.google.com/document/u/1/d/e/2PACX-1vRTJ22UiHpPaafBlY2vNxQr1ROjq1iFp8_3rlVPYFqf3Se316Vf4Ucw2fljzDA8PPVqyMuWqf-t70s5/pub"],
    "Field-3": ["", "", ""],
    "Field-4": ["", "", ""],
    "Field-5": ["", "", ""],
    "Field-6": ["", "", ""],
    "Related-Q":"What is Kanjii / What is Kana",
    "context_set": ""
   }
    
]
}